seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
        <register>
          <dim>3</dim>
          <dimIncrement>0xC0</dimIncrement>
          <name>OUT_EOF_DES_ADDR_CH%s</name>
          <description>Outlink descriptor address when EOF occurs of Tx channel 0</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OUT_EOF_DES_ADDR_CH</name>
              <description>This register stores the address of the outlink descriptor when the EOF bit in this descriptor is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0xC0</dimIncrement>
          <name>OUT_EOF_BFR_DES_ADDR_CH%s</name>
          <description>The last outlink descriptor address when EOF occurs of Tx channel 0</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OUT_EOF_BFR_DES_ADDR_CH</name>
              <description>This register stores the address of the outlink descriptor before the last outlink descriptor.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0xC0</dimIncrement>
          <name>OUT_DSCR_CH%s</name>
          <description>Current inlink descriptor address of Tx channel 0</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_CH</name>
              <description>The address of the current outlink descriptor y.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0xC0</dimIncrement>
          <name>OUT_DSCR_BF0_CH%s</name>
          <description>The last inlink descriptor address of Tx channel 0</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_BF0_CH</name>
              <description>The address of the last outlink descriptor y-1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0xC0</dimIncrement>
          <name>OUT_DSCR_BF1_CH%s</name>
          <description>The second-to-last inlink descriptor address of Tx channel 0</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_BF1_CH</name>
              <description>The address of the second-to-last inlink descriptor x-2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0xC0</dimIncrement>
          <name>OUT_PRI_CH%s</name>
          <description>Priority register of Tx channel 0.</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_PRI_CH</name>
              <description>The priority of Tx channel 0. The larger of the value the higher of the priority.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0xC0</dimIncrement>
          <name>OUT_PERI_SEL_CH%s</name>
          <description>Peripheral selection of Tx channel 0</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000003F</resetValue>
          <fields>
            <field>
              <name>PERI_OUT_SEL_CH</name>
              <description>This register is used to select peripheral for Tx channel 0. I3C. 1: Dummy. 2: UHCI0. 3: I2S0. 4: I2S1. 5: I2S2. 6: Dummy. 7: Dummy. 8: ADC_DAC. 9: Dummy. 10: RMT,11~15: Dummy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0xC0</dimIncrement>
          <name>OUT_CONF0_CH%s</name>
          <description>Configure 0 register of Tx channel 1</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>OUT_RST_CH</name>
              <description>This bit is used to reset AHB_DMA channel 1 Tx FSM and Tx FIFO pointer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_LOOP_TEST_CH</name>
              <description>reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_AUTO_WRBACK_CH</name>
              <description>Set this bit to enable automatic outlink-writeback when all the data in tx buffer has been transmitted.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_EOF_MODE_CH</name>
              <description>EOF flag generation mode when transmitting data. 1: EOF flag for Tx channel 1 is generated when data need to transmit has been popped from FIFO in AHB_DMA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTDSCR_BURST_EN_CH</name>
              <description>Set this bit to 1 to enable INCR burst transfer for Tx channel 1 reading link descriptor when accessing internal SRAM.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_DATA_BURST_EN_CH</name>
              <description>Set this bit to 1 to enable INCR burst transfer for Tx channel 1 transmitting data when accessing internal SRAM.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_ETM_EN_CH</name>
              <description>Set this bit to 1 to enable etm control mode, dma Tx channel 1 is triggered by etm task.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>OUT_CRC_INIT_DATA_CH%s</name>
          <description>This register is used to config ch0 crc initial data(max 32 bit)</description>
          <addressOffset>0x2BC</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>OUT_CRC_INIT_DATA_CH</name>
              <description>This register is used to config ch0 of tx crc initial value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>TX_CRC_WIDTH_CH%s</name>
          <description>This register is used to confiig tx ch0 crc result width,2'b00 mean crc_width &lt;=8bit,2'b01 8&lt;crc_width&lt;=16 ,2'b10 mean 16&lt;crc_width  &lt;=24,2'b11 mean 24&lt;crc_width&lt;=32</description>
          <addressOffset>0x2C0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_CRC_WIDTH_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_CRC_LAUTCH_FLGA_CH</name>
              <description>reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>OUT_CRC_CLEAR_CH%s</name>
          <description>This register is used to clear ch0 crc result</description>
          <addressOffset>0x2C4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OUT_CRC_CLEAR_CH</name>
              <description>This register is used to clear ch0 of tx crc result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>OUT_CRC_FINAL_RESULT_CH%s</name>
          <description>This register is used to store ch0 crc result</description>
          <addressOffset>0x2C8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OUT_CRC_FINAL_RESULT_CH</name>
              <description>This register is used to store result ch0 of tx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>TX_CRC_EN_WR_DATA_CH%s</name>
          <description>This resister is used to config ch0 crc en for every bit</description>
          <addressOffset>0x2CC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_CRC_EN_WR_DATA_CH</name>
              <description>This register is used to enable tx ch0 crc 32bit on/off</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>TX_CRC_EN_ADDR_CH%s</name>
          <description>This register is used to config ch0 crc en addr</description>
          <addressOffset>0x2D0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_CRC_EN_ADDR_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>TX_CRC_DATA_EN_WR_DATA_CH%s</name>
          <description>This register is used to config crc data_8bit en</description>
          <addressOffset>0x2D4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_CRC_DATA_EN_WR_DATA_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>TX_CRC_DATA_EN_ADDR_CH%s</name>
          <description>This register is used to config addr of crc data_8bit en</description>
          <addressOffset>0x2D8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_CRC_DATA_EN_ADDR_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>TX_CH_ARB_WEIGH_CH%s</name>
          <description>This register is used to config ch0 arbiter weigh</description>
          <addressOffset>0x2DC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_CH_ARB_WEIGH_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>TX_ARB_WEIGH_OPT_DIR_CH%s</name>
          <description>This register is used to config off or on weigh optimization</description>
          <addressOffset>0x2E0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_ARB_WEIGH_OPT_DIR_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>IN_CRC_INIT_DATA_CH%s</name>
          <description>This register is used to config ch0 crc initial data(max 32 bit)</description>
          <addressOffset>0x334</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>IN_CRC_INIT_DATA_CH</name>
              <description>This register is used to config ch0 of rx crc initial value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>RX_CRC_WIDTH_CH%s</name>
          <description>This register is used to confiig rx ch0 crc result width,2'b00 mean crc_width &lt;=8bit,2'b01 8&lt;crc_width&lt;=16 ,2'b10 mean 16&lt;crc_width  &lt;=24,2'b11 mean 24&lt;crc_width&lt;=32</description>
          <addressOffset>0x338</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_CRC_WIDTH_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CRC_LAUTCH_FLGA_CH</name>
              <description>reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>IN_CRC_CLEAR_CH%s</name>
          <description>This register is used to clear ch0 crc result</description>
          <addressOffset>0x33C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN_CRC_CLEAR_CH</name>
              <description>This register is used to clear ch0 of rx crc result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>IN_CRC_FINAL_RESULT_CH%s</name>
          <description>This register is used to store ch0 crc result</description>
          <addressOffset>0x340</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN_CRC_FINAL_RESULT_CH</name>
              <description>This register is used to store result ch0 of rx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>RX_CRC_EN_WR_DATA_CH%s</name>
          <description>This resister is used to config ch0 crc en for every bit</description>
          <addressOffset>0x344</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_CRC_EN_WR_DATA_CH</name>
              <description>This register is used to enable rx ch0 crc 32bit on/off</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>RX_CRC_EN_ADDR_CH%s</name>
          <description>This register is used to config ch0 crc en addr</description>
          <addressOffset>0x348</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_CRC_EN_ADDR_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>RX_CRC_DATA_EN_WR_DATA_CH%s</name>
          <description>This register is used to config crc data_8bit en</description>
          <addressOffset>0x34C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_CRC_DATA_EN_WR_DATA_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>RX_CRC_DATA_EN_ADDR_CH%s</name>
          <description>This register is used to config addr of crc data_8bit en</description>
          <addressOffset>0x350</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_CRC_DATA_EN_ADDR_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>RX_CH_ARB_WEIGH_CH%s</name>
          <description>This register is used to config ch0 arbiter weigh</description>
          <addressOffset>0x354</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_CH_ARB_WEIGH_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>RX_ARB_WEIGH_OPT_DIR_CH%s</name>
          <description>This register is used to config off or on weigh optimization</description>
          <addressOffset>0x358</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_ARB_WEIGH_OPT_DIR_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>IN_LINK_ADDR_CH%s</name>
          <description>Link descriptor configure of Rx channel 0</description>
          <addressOffset>0x3AC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INLINK_ADDR_CH</name>
              <description>This register stores the 32 least significant bits of the first inlink descriptor's address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>OUT_LINK_ADDR_CH%s</name>
          <description>Link descriptor configure of Tx channel 0</description>
          <addressOffset>0x3B8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OUTLINK_ADDR_CH</name>
              <description>This register stores the 32 least significant bits of the first outlink descriptor's address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MEM_START_ADDR</name>
          <description>The start address of accessible address space.</description>
          <addressOffset>0x3C4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACCESS_INTR_MEM_START_ADDR</name>
              <description>The start address of accessible address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MEM_END_ADDR</name>
          <description>The end address of accessible address space. The access address beyond this range would lead to descriptor error.</description>
          <addressOffset>0x3C8</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>ACCESS_INTR_MEM_END_ADDR</name>
              <description>The end address of accessible address space. The access address beyond this range would lead to descriptor error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
