seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
        <register>
          <name>CORE1_TRACE_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_CORE1_TRACE_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CORE_CTRL_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x18C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_HP_CORE_CTRL_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISP_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_ISP_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I3C_MST_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_I3C_MST_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I3C_SLV_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_I3C_SLV_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_OTG11_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x19C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_USB_OTG11_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2D_IN_CH0_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1A0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_DMA2D_IN_CH0_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2D_IN_CH1_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1A4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_DMA2D_IN_CH1_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2D_OUT_CH0_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1A8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_DMA2D_OUT_CH0_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2D_OUT_CH1_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1AC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_DMA2D_OUT_CH1_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2D_OUT_CH2_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1B0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_DMA2D_OUT_CH2_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSRAM_MSPI_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1B4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_PSRAM_MSPI_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SYSREG_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1B8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_HP_SYSREG_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCNT_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1BC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_PCNT_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PAU_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1C0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_HP_PAU_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PARLIO_RX_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1C4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_HP_PARLIO_RX_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PARLIO_TX_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1C8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_HP_PARLIO_TX_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>H264_DMA2D_OUT_CH0_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1CC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_H264_DMA2D_OUT_CH0_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>H264_DMA2D_OUT_CH1_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1D0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_H264_DMA2D_OUT_CH1_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>H264_DMA2D_OUT_CH2_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1D4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_H264_DMA2D_OUT_CH2_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>H264_DMA2D_OUT_CH3_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1D8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_H264_DMA2D_OUT_CH3_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>H264_DMA2D_OUT_CH4_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1DC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_H264_DMA2D_OUT_CH4_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>H264_DMA2D_IN_CH0_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1E0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_H264_DMA2D_IN_CH0_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>H264_DMA2D_IN_CH1_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1E4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_H264_DMA2D_IN_CH1_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>H264_DMA2D_IN_CH2_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1E8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_H264_DMA2D_IN_CH2_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>H264_DMA2D_IN_CH3_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1EC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_H264_DMA2D_IN_CH3_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>H264_DMA2D_IN_CH4_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1F0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_H264_DMA2D_IN_CH4_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>H264_DMA2D_IN_CH5_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1F4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_H264_DMA2D_IN_CH5_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>H264_REG_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1F8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_H264_REG_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASSIST_DEBUG_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1FC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_ASSIST_DEBUG_INT_MAP</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_STATUS_REG_0</name>
          <description>NA</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_INTR_STATUS_0</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_STATUS_REG_1</name>
          <description>NA</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_INTR_STATUS_1</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_STATUS_REG_2</name>
          <description>NA</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_INTR_STATUS_2</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_STATUS_REG_3</name>
          <description>NA</description>
          <addressOffset>0x20C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE1_INTR_STATUS_3</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>NA</description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CORE1_REG_CLK_EN</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERRUPT_REG_DATE</name>
          <description>NA</description>
          <addressOffset>0x3FC</addressOffset>
          <size>0x20</size>
          <resetValue>0x02003020</resetValue>
          <fields>
            <field>
              <name>CORE1_INTERRUPT_REG_DATE</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
