seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
        <register>
          <name>INT_MSK_ECC_CORRECTED</name>
          <description>NA</description>
          <addressOffset>0x2D4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MASK_ERR_ECC_CORRECTED_VC0</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ERR_ECC_CORRECTED_VC1</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ERR_ECC_CORRECTED_VC2</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ERR_ECC_CORRECTED_VC3</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ERR_ECC_CORRECTED_VC4</name>
              <description>NA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ERR_ECC_CORRECTED_VC5</name>
              <description>NA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ERR_ECC_CORRECTED_VC6</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ERR_ECC_CORRECTED_VC7</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ERR_ECC_CORRECTED_VC8</name>
              <description>NA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ERR_ECC_CORRECTED_VC9</name>
              <description>NA</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ERR_ECC_CORRECTED_VC10</name>
              <description>NA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ERR_ECC_CORRECTED_VC11</name>
              <description>NA</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ERR_ECC_CORRECTED_VC12</name>
              <description>NA</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ERR_ECC_CORRECTED_VC13</name>
              <description>NA</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ERR_ECC_CORRECTED_VC14</name>
              <description>NA</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_ERR_ECC_CORRECTED_VC15</name>
              <description>NA</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_FORCE_ECC_CORRECTED</name>
          <description>NA</description>
          <addressOffset>0x2D8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FORCE_ERR_ECC_CORRECTED_VC0</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_ECC_CORRECTED_VC1</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_ECC_CORRECTED_VC2</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_ECC_CORRECTED_VC3</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_ECC_CORRECTED_VC4</name>
              <description>NA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_ECC_CORRECTED_VC5</name>
              <description>NA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_ECC_CORRECTED_VC6</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_ECC_CORRECTED_VC7</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_ECC_CORRECTED_VC8</name>
              <description>NA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_ECC_CORRECTED_VC9</name>
              <description>NA</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_ECC_CORRECTED_VC10</name>
              <description>NA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_ECC_CORRECTED_VC11</name>
              <description>NA</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_ECC_CORRECTED_VC12</name>
              <description>NA</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_ECC_CORRECTED_VC13</name>
              <description>NA</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_ECC_CORRECTED_VC14</name>
              <description>NA</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_ERR_ECC_CORRECTED_VC15</name>
              <description>NA</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCRAMBLING</name>
          <description>NA</description>
          <addressOffset>0x300</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SCRAMBLE_ENABLE</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCRAMBLING_SEED1</name>
          <description>NA</description>
          <addressOffset>0x304</addressOffset>
          <size>0x20</size>
          <resetValue>0x00001008</resetValue>
          <fields>
            <field>
              <name>SCRAMBLE_SEED_LANE1</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCRAMBLING_SEED2</name>
          <description>NA</description>
          <addressOffset>0x308</addressOffset>
          <size>0x20</size>
          <resetValue>0x00001188</resetValue>
          <fields>
            <field>
              <name>SCRAMBLE_SEED_LANE2</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
