seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
        <register>
          <name>CH3_INTSTATUS_ENABLE0</name>
          <description>NA</description>
          <addressOffset>0x380</addressOffset>
          <size>0x20</size>
          <resetValue>0xFA3F7FFB</resetValue>
          <fields>
            <field>
              <name>CH3_ENABLE_BLOCK_TFR_DONE_INTSTAT</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ENABLE_DMA_TFR_DONE_INTSTAT</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ENABLE_SRC_TRANSCOMP_INTSTAT</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ENABLE_DST_TRANSCOMP_INTSTAT</name>
              <description>NA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ENABLE_SRC_DEC_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ENABLE_DST_DEC_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ENABLE_SRC_SLV_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ENABLE_DST_SLV_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ENABLE_LLI_RD_DEC_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ENABLE_LLI_WR_DEC_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ENABLE_LLI_RD_SLV_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ENABLE_LLI_WR_SLV_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ENABLE_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ENABLE_SLVIF_MULTIBLKTYPE_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ENABLE_SLVIF_DEC_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ENABLE_SLVIF_WR2RO_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ENABLE_SLVIF_RD2RWO_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ENABLE_SLVIF_WRONCHEN_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ENABLE_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ENABLE_SLVIF_WRONHOLD_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ENABLE_SLVIF_WRPARITY_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_ENABLE_CH_LOCK_CLEARED_INTSTAT</name>
              <description>NA</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ENABLE_CH_SRC_SUSPENDED_INTSTAT</name>
              <description>NA</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ENABLE_CH_SUSPENDED_INTSTAT</name>
              <description>NA</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ENABLE_CH_DISABLED_INTSTAT</name>
              <description>NA</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ENABLE_CH_ABORTED_INTSTAT</name>
              <description>NA</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3_INTSTATUS_ENABLE1</name>
          <description>NA</description>
          <addressOffset>0x384</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>CH3_ENABLE_ECC_PROT_CHMEM_CORRERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_ENABLE_ECC_PROT_CHMEM_UNCORRERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_ENABLE_ECC_PROT_UIDMEM_CORRERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_ENABLE_ECC_PROT_UIDMEM_UNCORRERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3_INTSTATUS0</name>
          <description>NA</description>
          <addressOffset>0x388</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH3_BLOCK_TFR_DONE_INTSTAT</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_DMA_TFR_DONE_INTSTAT</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_SRC_TRANSCOMP_INTSTAT</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_DST_TRANSCOMP_INTSTAT</name>
              <description>NA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_SRC_DEC_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_DST_DEC_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_SRC_SLV_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_DST_SLV_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_LLI_RD_DEC_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_LLI_WR_DEC_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_LLI_RD_SLV_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_LLI_WR_SLV_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_SLVIF_MULTIBLKTYPE_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_SLVIF_DEC_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_SLVIF_WR2RO_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_SLVIF_RD2RWO_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_SLVIF_WRONCHEN_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_SLVIF_WRONHOLD_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_SLVIF_WRPARITY_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_CH_LOCK_CLEARED_INTSTAT</name>
              <description>NA</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_CH_SRC_SUSPENDED_INTSTAT</name>
              <description>NA</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_CH_SUSPENDED_INTSTAT</name>
              <description>NA</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_CH_DISABLED_INTSTAT</name>
              <description>NA</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_CH_ABORTED_INTSTAT</name>
              <description>NA</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3_INTSTATUS1</name>
          <description>NA</description>
          <addressOffset>0x38C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH3_ECC_PROT_CHMEM_CORRERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_ECC_PROT_CHMEM_UNCORRERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_ECC_PROT_UIDMEM_CORRERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_ECC_PROT_UIDMEM_UNCORRERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
