seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
        <register>
          <name>CH4_CTL1</name>
          <description>NA</description>
          <addressOffset>0x41C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH4_AR_PROT</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_AW_PROT</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_ARLEN_EN</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_ARLEN</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_AWLEN_EN</name>
              <description>NA</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_AWLEN</name>
              <description>NA</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_SRC_STAT_EN</name>
              <description>NA</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_DST_STAT_EN</name>
              <description>NA</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_IOC_BLKTFR</name>
              <description>NA</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_SHADOWREG_OR_LLI_LAST</name>
              <description>NA</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_SHADOWREG_OR_LLI_VALID</name>
              <description>NA</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_CFG0</name>
          <description>NA</description>
          <addressOffset>0x420</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH4_SRC_MULTBLK_TYPE</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_DST_MULTBLK_TYPE</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_RD_UID</name>
              <description>NA</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH4_WR_UID</name>
              <description>NA</description>
              <bitOffset>25</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_CFG1</name>
          <description>NA</description>
          <addressOffset>0x424</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000001B</resetValue>
          <fields>
            <field>
              <name>CH4_TT_FC</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_HS_SEL_SRC</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_HS_SEL_DST</name>
              <description>NA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_SRC_HWHS_POL</name>
              <description>NA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH4_DST_HWHS_POL</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH4_SRC_PER</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_DST_PER</name>
              <description>NA</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_CH_PRIOR</name>
              <description>NA</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_LOCK_CH</name>
              <description>NA</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH4_LOCK_CH_L</name>
              <description>NA</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH4_SRC_OSR_LMT</name>
              <description>NA</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_DST_OSR_LMT</name>
              <description>NA</description>
              <bitOffset>27</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_LLP0</name>
          <description>NA</description>
          <addressOffset>0x428</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH4_LMS</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_LOC0</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_LLP1</name>
          <description>NA</description>
          <addressOffset>0x42C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH4_LOC1</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_STATUS0</name>
          <description>NA</description>
          <addressOffset>0x430</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH4_CMPLTD_BLK_TFR_SIZE</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_STATUS1</name>
          <description>NA</description>
          <addressOffset>0x434</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH4_DATA_LEFT_IN_FIFO</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_SWHSSRC0</name>
          <description>NA</description>
          <addressOffset>0x438</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH4_SWHS_REQ_SRC</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_SWHS_REQ_SRC_WE</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH4_SWHS_SGLREQ_SRC</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_SWHS_SGLREQ_SRC_WE</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH4_SWHS_LST_SRC</name>
              <description>NA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_SWHS_LST_SRC_WE</name>
              <description>NA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_SWHSDST0</name>
          <description>NA</description>
          <addressOffset>0x440</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH4_SWHS_REQ_DST</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_SWHS_REQ_DST_WE</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH4_SWHS_SGLREQ_DST</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_SWHS_SGLREQ_DST_WE</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH4_SWHS_LST_DST</name>
              <description>NA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_SWHS_LST_DST_WE</name>
              <description>NA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_BLK_TFR_RESUMEREQ0</name>
          <description>NA</description>
          <addressOffset>0x448</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH4_BLK_TFR_RESUMEREQ</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_AXI_ID0</name>
          <description>NA</description>
          <addressOffset>0x450</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH4_AXI_READ_ID_SUFFIX</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_AXI_WRITE_ID_SUFFIX</name>
              <description>NA</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_AXI_QOS0</name>
          <description>NA</description>
          <addressOffset>0x458</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH4_AXI_AWQOS</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_AXI_ARQOS</name>
              <description>NA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_SSTAT0</name>
          <description>NA</description>
          <addressOffset>0x460</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH4_SSTAT</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_DSTAT0</name>
          <description>NA</description>
          <addressOffset>0x468</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH4_DSTAT</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_SSTATAR0</name>
          <description>NA</description>
          <addressOffset>0x470</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH4_SSTATAR0</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_SSTATAR1</name>
          <description>NA</description>
          <addressOffset>0x474</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH4_SSTATAR1</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_DSTATAR0</name>
          <description>NA</description>
          <addressOffset>0x478</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH4_DSTATAR0</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_DSTATAR1</name>
          <description>NA</description>
          <addressOffset>0x47C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH4_DSTATAR1</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
