seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MIPI_DSI_BRIDGE</name>
      <description>MIPI Camera Interface Bridge</description>
      <groupName>DSI_BRG</groupName>
      <baseAddress>0x500A0800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x94</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DSI_BRIDGE</name>
        <value>86</value>
      </interrupt>
      <registers>
        <register>
          <name>CLK_EN</name>
          <description>dsi bridge clk control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>this bit configures force_on of dsi_bridge register clock gate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EN</name>
          <description>dsi bridge en register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DSI_EN</name>
              <description>this bit configures module enable of dsi_bridge. 0: disable, 1: enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_REQ_CFG</name>
          <description>dsi bridge dma burst len register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000080</resetValue>
          <fields>
            <field>
              <name>DMA_BURST_LEN</name>
              <description>this field configures the num of 64-bit in one dma burst transfer, valid only when dsi_bridge as flow controller</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAW_NUM_CFG</name>
          <description>dsi bridge raw number control register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00038400</resetValue>
          <fields>
            <field>
              <name>RAW_NUM_TOTAL</name>
              <description>this field configures number of total pix bits/64</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNALIGN_64BIT_EN</name>
              <description>this field configures whether the total pix bits is a multiple of 64bits. 0: align to 64-bit, 1: unalign to 64-bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAW_NUM_TOTAL_SET</name>
              <description>this bit configures enable of reload reg_raw_num_total to internal cnt. 0: disable, 1: enable. valid only when dsi_bridge as flow controller</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAW_BUF_CREDIT_CTL</name>
          <description>dsi bridge credit register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x03200400</resetValue>
          <fields>
            <field>
              <name>CREDIT_THRD</name>
              <description>this field configures the threshold whether dsi_bridge fifo can receive one more 64-bit, valid only when dsi_bridge as flow controller</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CREDIT_BURST_THRD</name>
              <description>this field configures the threshold whether dsi_bridge fifo can receive one more dma burst, valid only when dsi_bridge as flow controller</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CREDIT_RESET</name>
              <description>this bit configures internal credit cnt clear, 0: non, 1: reset. valid only when dsi_bridge as flow controller</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO_FLOW_STATUS</name>
          <description>dsi bridge raw buffer depth register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RAW_BUF_DEPTH</name>
              <description>this field configures the depth of dsi_bridge fifo depth</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIXEL_TYPE</name>
          <description>dsi bridge dpi type control register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RAW_TYPE</name>
              <description>this field configures the pixel type. 0: rgb888, 1:rgb666, 2:rgb565</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPI_CONFIG</name>
              <description>this field configures the pixel arrange type of dpi interface</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_IN_TYPE</name>
              <description>input data type, 0: rgb, 1: yuv</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_BLOCK_INTERVAL</name>
          <description>dsi bridge dma block interval control register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetValue>0x30002409</resetValue>
          <fields>
            <field>
              <name>DMA_BLOCK_SLOT</name>
              <description>this field configures the max block_slot_cnt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_BLOCK_INTERVAL</name>
              <description>this field configures the max block_interval_cnt, block_interval_cnt increased by 1 when block_slot_cnt if full</description>
              <bitOffset>10</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAW_NUM_TOTAL_AUTO_RELOAD</name>
              <description>this bit configures enable of auto reload reg_raw_num_total, 0: disable, 1: enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>this bit configures enable of interval between dma block transfer, 0: disable, 1: enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_REQ_INTERVAL</name>
          <description>dsi bridge dma req interval control register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>DMA_REQ_INTERVAL</name>
              <description>this field configures the interval between dma req events</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPI_LCD_CTL</name>
          <description>dsi bridge dpi signal control register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DPISHUTDN</name>
              <description>this bit configures dpishutdn signal in dpi interface</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPICOLORM</name>
              <description>this bit configures dpicolorm signal in dpi interface</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPIUPDATECFG</name>
              <description>this bit configures dpiupdatecfg signal in dpi interface</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPI_RSV_DPI_DATA</name>
          <description>dsi bridge dpi reserved data register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x00003FFF</resetValue>
          <fields>
            <field>
              <name>DPI_RSV_DATA</name>
              <description>this field controls the pixel data sent to dsi_host when dsi_bridge fifo underflow</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPI_V_CFG0</name>
          <description>dsi bridge dpi v config register 0</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x01E0020D</resetValue>
          <fields>
            <field>
              <name>VTOTAL</name>
              <description>this field configures the total length of one frame (by line) for dpi output, must meet: reg_vtotal > reg_vdisp+reg_vsync+reg_vbank</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDISP</name>
              <description>this field configures the length of valid line (by line) for dpi output</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPI_V_CFG1</name>
          <description>dsi bridge dpi v config register 1</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00020021</resetValue>
          <fields>
            <field>
              <name>VBANK</name>
              <description>this field configures the length between vsync and valid line (by line) for dpi output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSYNC</name>
              <description>this field configures the length of vsync (by line) for dpi output</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPI_H_CFG0</name>
          <description>dsi bridge dpi h config register 0</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0x02800320</resetValue>
          <fields>
            <field>
              <name>HTOTAL</name>
              <description>this field configures the total length of one line (by pixel num) for dpi output, must meet: reg_htotal > reg_hdisp+reg_hsync+reg_hbank</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HDISP</name>
              <description>this field configures the length of valid pixel data (by pixel num) for dpi output</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPI_H_CFG1</name>
          <description>dsi bridge dpi h config register 1</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00600030</resetValue>
          <fields>
            <field>
              <name>HBANK</name>
              <description>this field configures the length between hsync and pixel data valid (by pixel num) for dpi output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSYNC</name>
              <description>this field configures the length of hsync (by pixel num) for dpi output</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPI_MISC_CONFIG</name>
          <description>dsi_bridge dpi misc config register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x000019D0</resetValue>
          <fields>
            <field>
              <name>DPI_EN</name>
              <description>this bit configures enable of dpi output, 0: disable, 1: enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFO_UNDERRUN_DISCARD_VCNT</name>
              <description>this field configures the underrun interrupt musk, when underrun occurs and line cnt is less then this field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPI_CONFIG_UPDATE</name>
          <description>dsi_bridge dpi config update register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DPI_CONFIG_UPDATE</name>
              <description>write 1 to this bit to update dpi config register MIPI_DSI_BRG_DPI_*</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>dsi_bridge interrupt enable register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>UNDERRUN_INT_ENA</name>
              <description>write 1 to enables dpi_underrun_int_st field of MIPI_DSI_BRG_INT_ST_REG controlled by dpi_underrun  interrupt signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>dsi_bridge interrupt clear register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>UNDERRUN_INT_CLR</name>
              <description>write 1 to this bit to clear dpi_underrun_int_raw field of MIPI_DSI_BRG_INT_RAW_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>dsi_bridge raw interrupt register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>UNDERRUN_INT_RAW</name>
              <description>the raw interrupt status of dpi_underrun</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>dsi_bridge masked interrupt register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>UNDERRUN_INT_ST</name>
              <description>the masked interrupt status of dpi_underrun</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HOST_BIST_CTL</name>
          <description>dsi_bridge host bist control register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BISTOK</name>
              <description>bistok</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BISTON</name>
              <description>biston</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HOST_TRIGGER_REV</name>
          <description>dsi_bridge host trigger reverse control register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_TRIGGER_REV_EN</name>
              <description>tx_trigger reverse. 0: disable, 1: enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_TRIGGER_REV_EN</name>
              <description>rx_trigger reverse. 0: disable, 1: enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK_RAW_NUM_CFG</name>
          <description>dsi_bridge block raw number control register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x00038400</resetValue>
          <fields>
            <field>
              <name>BLK_RAW_NUM_TOTAL</name>
              <description>this field configures number of total block pix bits/64</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLK_RAW_NUM_TOTAL_SET</name>
              <description>write 1 to reload reg_blk_raw_num_total to internal cnt</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_FRAME_INTERVAL</name>
          <description>dsi_bridge dam frame interval control register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <resetValue>0x20002409</resetValue>
          <fields>
            <field>
              <name>DMA_FRAME_SLOT</name>
              <description>this field configures the max frame_slot_cnt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_FRAME_INTERVAL</name>
              <description>this field configures the max frame_interval_cnt, frame_interval_cnt increased by 1 when frame_slot_cnt if full</description>
              <bitOffset>10</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_MULTIBLK_EN</name>
              <description>this bit configures enable multi-blk transfer, 0: disable, 1: enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>this bit configures enable interval between frame transfer, 0: disable, 1: enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_AUX_CTRL</name>
          <description>dsi_bridge mem aux control register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <resetValue>0x00001320</resetValue>
          <fields>
            <field>
              <name>DSI_MEM_AUX_CTRL</name>
              <description>this field configures dsi_bridge fifo memory aux ctrl</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDN_ECO_CS</name>
          <description>dsi_bridge rdn eco cs register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RDN_ECO_EN</name>
              <description>rdn_eco_en</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDN_ECO_RESULT</name>
              <description>rdn_eco_result</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
