seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
        <register>
          <name>WR_TIM_CONF1</name>
          <description>Configurarion register 1 of eFuse programming timing parameters.</description>
          <addressOffset>0x1F0</addressOffset>
          <size>0x20</size>
          <resetValue>0x01266701</resetValue>
          <fields>
            <field>
              <name>TSUP_A</name>
              <description>Configures the programming setup time.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWR_ON_NUM</name>
              <description>Configures the power up time for VDDQ.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THP_A</name>
              <description>Configures the programming hold time.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WR_TIM_CONF2</name>
          <description>Configurarion register 2 of eFuse programming timing parameters.</description>
          <addressOffset>0x1F4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00A00140</resetValue>
          <fields>
            <field>
              <name>PWR_OFF_NUM</name>
              <description>Configures the power outage time for VDDQ.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TPGM</name>
              <description>Configures the active programming time.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WR_TIM_CONF0_RS_BYPASS</name>
          <description>Configurarion register0 of eFuse programming time parameters and rs bypass operation.</description>
          <addressOffset>0x1F8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00002000</resetValue>
          <fields>
            <field>
              <name>BYPASS_RS_CORRECTION</name>
              <description>Set this bit to bypass reed solomon correction step.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_RS_BLK_NUM</name>
              <description>Configures block number of programming twice operation.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDATE</name>
              <description>Set this bit to update multi-bit register signals.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TPGM_INACTIVE</name>
              <description>Configures the inactive programming time.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>eFuse version register.</description>
          <addressOffset>0x1FC</addressOffset>
          <size>0x20</size>
          <resetValue>0x02305050</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Stores eFuse version.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_WR_DIS</name>
          <description>eFuse apb2otp block0 data register1.</description>
          <addressOffset>0x800</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_WR_DIS</name>
              <description>Otp block0 write disable data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP1_W1</name>
          <description>eFuse apb2otp block0 data register2.</description>
          <addressOffset>0x804</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP1_W1</name>
              <description>Otp block0 backup1 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP1_W2</name>
          <description>eFuse apb2otp block0 data register3.</description>
          <addressOffset>0x808</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP1_W2</name>
              <description>Otp block0 backup1 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP1_W3</name>
          <description>eFuse apb2otp block0 data register4.</description>
          <addressOffset>0x80C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP1_W3</name>
              <description>Otp block0 backup1 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP1_W4</name>
          <description>eFuse apb2otp block0 data register5.</description>
          <addressOffset>0x810</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP1_W4</name>
              <description>Otp block0 backup1 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP1_W5</name>
          <description>eFuse apb2otp block0 data register6.</description>
          <addressOffset>0x814</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP1_W5</name>
              <description>Otp block0 backup1 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP2_W1</name>
          <description>eFuse apb2otp block0 data register7.</description>
          <addressOffset>0x818</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP2_W1</name>
              <description>Otp block0 backup2 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP2_W2</name>
          <description>eFuse apb2otp block0 data register8.</description>
          <addressOffset>0x81C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP2_W2</name>
              <description>Otp block0 backup2 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP2_W3</name>
          <description>eFuse apb2otp block0 data register9.</description>
          <addressOffset>0x820</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP2_W3</name>
              <description>Otp block0 backup2 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP2_W4</name>
          <description>eFuse apb2otp block0 data register10.</description>
          <addressOffset>0x824</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP2_W4</name>
              <description>Otp block0 backup2 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP2_W5</name>
          <description>eFuse apb2otp block0 data register11.</description>
          <addressOffset>0x828</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP2_W5</name>
              <description>Otp block0 backup2 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP3_W1</name>
          <description>eFuse apb2otp block0 data register12.</description>
          <addressOffset>0x82C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP3_W1</name>
              <description>Otp block0 backup3 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP3_W2</name>
          <description>eFuse apb2otp block0 data register13.</description>
          <addressOffset>0x830</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP3_W2</name>
              <description>Otp block0 backup3 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP3_W3</name>
          <description>eFuse apb2otp block0 data register14.</description>
          <addressOffset>0x834</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP3_W3</name>
              <description>Otp block0 backup3 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP3_W4</name>
          <description>eFuse apb2otp block0 data register15.</description>
          <addressOffset>0x838</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP3_W4</name>
              <description>Otp block0 backup3 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP3_W5</name>
          <description>eFuse apb2otp block0 data register16.</description>
          <addressOffset>0x83C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP3_W5</name>
              <description>Otp block0 backup3 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP4_W1</name>
          <description>eFuse apb2otp block0 data register17.</description>
          <addressOffset>0x840</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP4_W1</name>
              <description>Otp block0 backup4 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP4_W2</name>
          <description>eFuse apb2otp block0 data register18.</description>
          <addressOffset>0x844</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP4_W2</name>
              <description>Otp block0 backup4 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP4_W3</name>
          <description>eFuse apb2otp block0 data register19.</description>
          <addressOffset>0x848</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP4_W3</name>
              <description>Otp block0 backup4 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP4_W4</name>
          <description>eFuse apb2otp block0 data register20.</description>
          <addressOffset>0x84C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP4_W4</name>
              <description>Otp block0 backup4 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP4_W5</name>
          <description>eFuse apb2otp block0 data register21.</description>
          <addressOffset>0x850</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP4_W5</name>
              <description>Otp block0 backup4 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W1</name>
          <description>eFuse apb2otp block1 data register1.</description>
          <addressOffset>0x854</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W1</name>
              <description>Otp block1  word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W2</name>
          <description>eFuse apb2otp block1 data register2.</description>
          <addressOffset>0x858</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W2</name>
              <description>Otp block1  word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W3</name>
          <description>eFuse apb2otp block1 data register3.</description>
          <addressOffset>0x85C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W3</name>
              <description>Otp block1  word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W4</name>
          <description>eFuse apb2otp block1 data register4.</description>
          <addressOffset>0x860</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W4</name>
              <description>Otp block1  word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W5</name>
          <description>eFuse apb2otp block1 data register5.</description>
          <addressOffset>0x864</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W5</name>
              <description>Otp block1  word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W6</name>
          <description>eFuse apb2otp block1 data register6.</description>
          <addressOffset>0x868</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W6</name>
              <description>Otp block1  word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W7</name>
          <description>eFuse apb2otp block1 data register7.</description>
          <addressOffset>0x86C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W7</name>
              <description>Otp block1  word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W8</name>
          <description>eFuse apb2otp block1 data register8.</description>
          <addressOffset>0x870</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W8</name>
              <description>Otp block1  word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W9</name>
          <description>eFuse apb2otp block1 data register9.</description>
          <addressOffset>0x874</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W9</name>
              <description>Otp block1  word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK2_W1</name>
          <description>eFuse apb2otp block2 data register1.</description>
          <addressOffset>0x878</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK2_W1</name>
              <description>Otp block2 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK2_W2</name>
          <description>eFuse apb2otp block2 data register2.</description>
          <addressOffset>0x87C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK2_W2</name>
              <description>Otp block2 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK2_W3</name>
          <description>eFuse apb2otp block2 data register3.</description>
          <addressOffset>0x880</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK2_W3</name>
              <description>Otp block2 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK2_W4</name>
          <description>eFuse apb2otp block2 data register4.</description>
          <addressOffset>0x884</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK2_W4</name>
              <description>Otp block2 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK2_W5</name>
          <description>eFuse apb2otp block2 data register5.</description>
          <addressOffset>0x888</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK2_W5</name>
              <description>Otp block2 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK2_W6</name>
          <description>eFuse apb2otp block2 data register6.</description>
          <addressOffset>0x88C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK2_W6</name>
              <description>Otp block2 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
