seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
        <register>
          <name>APB2OTP_BLK2_W7</name>
          <description>eFuse apb2otp block2 data register7.</description>
          <addressOffset>0x890</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK2_W7</name>
              <description>Otp block2 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK2_W8</name>
          <description>eFuse apb2otp block2 data register8.</description>
          <addressOffset>0x894</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK2_W8</name>
              <description>Otp block2 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK2_W9</name>
          <description>eFuse apb2otp block2 data register9.</description>
          <addressOffset>0x898</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK2_W9</name>
              <description>Otp block2 word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK2_W10</name>
          <description>eFuse apb2otp block2 data register10.</description>
          <addressOffset>0x89C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK2_W10</name>
              <description>Otp block2 word10 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK2_W11</name>
          <description>eFuse apb2otp block2 data register11.</description>
          <addressOffset>0x8A0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK2_W11</name>
              <description>Otp block2 word11 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK3_W1</name>
          <description>eFuse apb2otp block3 data register1.</description>
          <addressOffset>0x8A4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK3_W1</name>
              <description>Otp block3 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK3_W2</name>
          <description>eFuse apb2otp block3 data register2.</description>
          <addressOffset>0x8A8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK3_W2</name>
              <description>Otp block3 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK3_W3</name>
          <description>eFuse apb2otp block3 data register3.</description>
          <addressOffset>0x8AC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK3_W3</name>
              <description>Otp block3 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK3_W4</name>
          <description>eFuse apb2otp block3 data register4.</description>
          <addressOffset>0x8B0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK3_W4</name>
              <description>Otp block3 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK3_W5</name>
          <description>eFuse apb2otp block3 data register5.</description>
          <addressOffset>0x8B4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK3_W5</name>
              <description>Otp block3 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK3_W6</name>
          <description>eFuse apb2otp block3 data register6.</description>
          <addressOffset>0x8B8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK3_W6</name>
              <description>Otp block3 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK3_W7</name>
          <description>eFuse apb2otp block3 data register7.</description>
          <addressOffset>0x8BC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK3_W7</name>
              <description>Otp block3 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK3_W8</name>
          <description>eFuse apb2otp block3 data register8.</description>
          <addressOffset>0x8C0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK3_W8</name>
              <description>Otp block3 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK3_W9</name>
          <description>eFuse apb2otp block3 data register9.</description>
          <addressOffset>0x8C4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK3_W9</name>
              <description>Otp block3 word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK3_W10</name>
          <description>eFuse apb2otp block3 data register10.</description>
          <addressOffset>0x8C8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK3_W10</name>
              <description>Otp block3 word10 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK3_W11</name>
          <description>eFuse apb2otp block3 data register11.</description>
          <addressOffset>0x8CC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK3_W11</name>
              <description>Otp block3 word11 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK4_W1</name>
          <description>eFuse apb2otp block4 data register1.</description>
          <addressOffset>0x8D0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK4_W1</name>
              <description>Otp block4 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK4_W2</name>
          <description>eFuse apb2otp block4 data register2.</description>
          <addressOffset>0x8D4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK4_W2</name>
              <description>Otp block4 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK4_W3</name>
          <description>eFuse apb2otp block4 data register3.</description>
          <addressOffset>0x8D8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK4_W3</name>
              <description>Otp block4 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK4_W4</name>
          <description>eFuse apb2otp block4 data register4.</description>
          <addressOffset>0x8DC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK4_W4</name>
              <description>Otp block4 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK4_W5</name>
          <description>eFuse apb2otp block4 data register5.</description>
          <addressOffset>0x8E0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK4_W5</name>
              <description>Otp block4 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK4_W6</name>
          <description>eFuse apb2otp block4 data register6.</description>
          <addressOffset>0x8E4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK4_W6</name>
              <description>Otp block4 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK4_W7</name>
          <description>eFuse apb2otp block4 data register7.</description>
          <addressOffset>0x8E8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK4_W7</name>
              <description>Otp block4 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK4_W8</name>
          <description>eFuse apb2otp block4 data register8.</description>
          <addressOffset>0x8EC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK4_W8</name>
              <description>Otp block4 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK4_W9</name>
          <description>eFuse apb2otp block4 data register9.</description>
          <addressOffset>0x8F0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK4_W9</name>
              <description>Otp block4 word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK4_W10</name>
          <description>eFuse apb2otp block4 data registe10.</description>
          <addressOffset>0x8F4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK4_W10</name>
              <description>Otp block4 word10 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK4_W11</name>
          <description>eFuse apb2otp block4 data register11.</description>
          <addressOffset>0x8F8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK4_W11</name>
              <description>Otp block4 word11 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK5_W1</name>
          <description>eFuse apb2otp block5 data register1.</description>
          <addressOffset>0x8FC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK5_W1</name>
              <description>Otp block5 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK5_W2</name>
          <description>eFuse apb2otp block5 data register2.</description>
          <addressOffset>0x900</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK5_W2</name>
              <description>Otp block5 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK5_W3</name>
          <description>eFuse apb2otp block5 data register3.</description>
          <addressOffset>0x904</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK5_W3</name>
              <description>Otp block5 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK5_W4</name>
          <description>eFuse apb2otp block5 data register4.</description>
          <addressOffset>0x908</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK5_W4</name>
              <description>Otp block5 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK5_W5</name>
          <description>eFuse apb2otp block5 data register5.</description>
          <addressOffset>0x90C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK5_W5</name>
              <description>Otp block5 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK5_W6</name>
          <description>eFuse apb2otp block5 data register6.</description>
          <addressOffset>0x910</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK5_W6</name>
              <description>Otp block5 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK5_W7</name>
          <description>eFuse apb2otp block5 data register7.</description>
          <addressOffset>0x914</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK5_W7</name>
              <description>Otp block5 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK5_W8</name>
          <description>eFuse apb2otp block5 data register8.</description>
          <addressOffset>0x918</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK5_W8</name>
              <description>Otp block5 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK5_W9</name>
          <description>eFuse apb2otp block5 data register9.</description>
          <addressOffset>0x91C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK5_W9</name>
              <description>Otp block5 word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK5_W10</name>
          <description>eFuse apb2otp block5 data register10.</description>
          <addressOffset>0x920</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK5_W10</name>
              <description>Otp block5 word10 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK5_W11</name>
          <description>eFuse apb2otp block5 data register11.</description>
          <addressOffset>0x924</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK5_W11</name>
              <description>Otp block5 word11 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK6_W1</name>
          <description>eFuse apb2otp block6 data register1.</description>
          <addressOffset>0x928</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK6_W1</name>
              <description>Otp block6 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK6_W2</name>
          <description>eFuse apb2otp block6 data register2.</description>
          <addressOffset>0x92C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK6_W2</name>
              <description>Otp block6 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK6_W3</name>
          <description>eFuse apb2otp block6 data register3.</description>
          <addressOffset>0x930</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK6_W3</name>
              <description>Otp block6 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK6_W4</name>
          <description>eFuse apb2otp block6 data register4.</description>
          <addressOffset>0x934</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK6_W4</name>
              <description>Otp block6 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK6_W5</name>
          <description>eFuse apb2otp block6 data register5.</description>
          <addressOffset>0x938</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK6_W5</name>
              <description>Otp block6 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK6_W6</name>
          <description>eFuse apb2otp block6 data register6.</description>
          <addressOffset>0x93C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK6_W6</name>
              <description>Otp block6 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
