seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
        <register>
          <name>INTR_2</name>
          <description>GPIO interrupt 2 status register for GPIO0-31</description>
          <addressOffset>0x63C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INT_2</name>
              <description>GPIO interrupt 2 status register for GPIO0-31</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR1_2</name>
          <description>GPIO interrupt 2 status register for GPIO32-56</description>
          <addressOffset>0x640</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INT1_2</name>
              <description>GPIO interrupt 2 status register for GPIO32-56</description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_3</name>
          <description>GPIO interrupt 3 status register for GPIO0-31</description>
          <addressOffset>0x644</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INT_3</name>
              <description>GPIO interrupt 3 status register for GPIO0-31</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR1_3</name>
          <description>GPIO interrupt 3 status register for GPIO32-56</description>
          <addressOffset>0x648</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INT1_3</name>
              <description>GPIO interrupt 3 status register for GPIO32-56</description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>GPIO clock gate register</description>
          <addressOffset>0x64C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>set this bit to enable GPIO clock gate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>analog comparator interrupt raw</description>
          <addressOffset>0x700</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMP0_NEG_INT_RAW</name>
              <description>analog comparator pos edge interrupt raw</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP0_POS_INT_RAW</name>
              <description>analog comparator neg edge interrupt raw</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP0_ALL_INT_RAW</name>
              <description>analog comparator neg or pos edge interrupt raw</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP1_NEG_INT_RAW</name>
              <description>analog comparator pos edge interrupt raw</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP1_POS_INT_RAW</name>
              <description>analog comparator neg edge interrupt raw</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP1_ALL_INT_RAW</name>
              <description>analog comparator neg or pos edge interrupt raw</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BISTOK_INT_RAW</name>
              <description>pad bistok interrupt raw</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BISTFAIL_INT_RAW</name>
              <description>pad bistfail interrupt raw</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>analog comparator interrupt status</description>
          <addressOffset>0x704</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMP0_NEG_INT_ST</name>
              <description>analog comparator pos edge interrupt status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP0_POS_INT_ST</name>
              <description>analog comparator neg edge interrupt status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP0_ALL_INT_ST</name>
              <description>analog comparator neg or pos edge interrupt status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP1_NEG_INT_ST</name>
              <description>analog comparator pos edge interrupt status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP1_POS_INT_ST</name>
              <description>analog comparator neg edge interrupt status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP1_ALL_INT_ST</name>
              <description>analog comparator neg or pos edge interrupt status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BISTOK_INT_ST</name>
              <description>pad bistok interrupt status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BISTFAIL_INT_ST</name>
              <description>pad bistfail interrupt status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>analog comparator interrupt enable</description>
          <addressOffset>0x708</addressOffset>
          <size>0x20</size>
          <resetValue>0x000000FF</resetValue>
          <fields>
            <field>
              <name>COMP0_NEG_INT_ENA</name>
              <description>analog comparator pos edge interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP0_POS_INT_ENA</name>
              <description>analog comparator neg edge interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP0_ALL_INT_ENA</name>
              <description>analog comparator neg or pos edge interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP1_NEG_INT_ENA</name>
              <description>analog comparator pos edge interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP1_POS_INT_ENA</name>
              <description>analog comparator neg edge interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP1_ALL_INT_ENA</name>
              <description>analog comparator neg or pos edge interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BISTOK_INT_ENA</name>
              <description>pad bistok interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BISTFAIL_INT_ENA</name>
              <description>pad bistfail interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>analog comparator interrupt clear</description>
          <addressOffset>0x70C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMP0_NEG_INT_CLR</name>
              <description>analog comparator pos edge interrupt clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COMP0_POS_INT_CLR</name>
              <description>analog comparator neg edge interrupt clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COMP0_ALL_INT_CLR</name>
              <description>analog comparator neg or pos edge interrupt clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COMP1_NEG_INT_CLR</name>
              <description>analog comparator pos edge interrupt clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COMP1_POS_INT_CLR</name>
              <description>analog comparator neg edge interrupt clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COMP1_ALL_INT_CLR</name>
              <description>analog comparator neg or pos edge interrupt clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BISTOK_INT_CLR</name>
              <description>pad bistok interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BISTFAIL_INT_CLR</name>
              <description>pad bistfail interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ZERO_DET0_FILTER_CNT</name>
          <description>GPIO analog comparator zero detect filter count</description>
          <addressOffset>0x710</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>ZERO_DET0_FILTER_CNT</name>
              <description>GPIO analog comparator zero detect filter count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ZERO_DET1_FILTER_CNT</name>
          <description>GPIO analog comparator zero detect filter count</description>
          <addressOffset>0x714</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>ZERO_DET1_FILTER_CNT</name>
              <description>GPIO analog comparator zero detect filter count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEND_SEQ</name>
          <description>High speed sdio pad bist send sequence</description>
          <addressOffset>0x718</addressOffset>
          <size>0x20</size>
          <resetValue>0x12345678</resetValue>
          <fields>
            <field>
              <name>SEND_SEQ</name>
              <description>High speed sdio pad bist send sequence</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RECIVE_SEQ</name>
          <description>High speed sdio pad bist recive sequence</description>
          <addressOffset>0x71C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RECIVE_SEQ</name>
              <description>High speed sdio pad bist recive sequence</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BISTIN_SEL</name>
          <description>High speed sdio pad bist in pad sel</description>
          <addressOffset>0x720</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>BISTIN_SEL</name>
              <description>High speed sdio pad bist in pad sel 0:pad39, 1: pad40...</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BIST_CTRL</name>
          <description>High speed sdio pad bist control</description>
          <addressOffset>0x724</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>BIST_PAD_OE</name>
              <description>High speed sdio pad bist out pad oe</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BIST_START</name>
              <description>High speed sdio pad bist start</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>GPIO version register</description>
          <addressOffset>0x7FC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00230403</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>version register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>254</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>1-254</dimIndex>
          <name>FUNC%s_IN_SEL_CFG</name>
          <description>GPIO input function configuration register</description>
          <addressOffset>0x15C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IN_SEL</name>
              <description>set this value: s=0-56: connect GPIO[s] to this port. s=0x3F: set this port always high level. s=0x3E: set this port always low level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN_INV_SEL</name>
              <description>set this bit to invert input signal. 1:invert. 0:not invert.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEL</name>
              <description>set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
