seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>H264</name>
      <description>H264 Encoder (Core)</description>
      <groupName>H264</groupName>
      <baseAddress>0x50084000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xF4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>H264_REG</name>
        <value>126</value>
      </interrupt>
      <registers>
        <register>
          <name>SYS_CTRL</name>
          <description>H264 system level control register.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FRAME_START</name>
              <description>Configures whether or not to start encoding one frame.\\0: Invalid. No effect\\1: Start encoding one frame</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA_MOVE_START</name>
              <description>Configures whether or not to start moving reference data from external mem.\\0: Invalid. No effect\\1: H264 start moving two MB lines of reference frame from external mem to internal mem</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FRAME_MODE</name>
              <description>Configures H264 running mode. When field H264_DUAL_STREAM_MODE is set to 1, this field must be set to 1 too.\\0: GOP mode. Before every GOP first frame start, need reconfig reference frame DMA\\1: Frame mode. Before every frame start, need reconfig reference frame DMA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYS_RST_PULSE</name>
              <description>Configures whether or not to reset H264 ip.\\0: Invalid. No effect\\1: Reset H264 ip</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GOP_CONF</name>
          <description>GOP related configuration register.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DUAL_STREAM_MODE</name>
              <description>Configures whether or not to enable dual stream mode. When this field is set to 1,  H264_FRAME_MODE field must be set to 1 too.\\0: Normal mode\\1: Dual stream mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GOP_NUM</name>
              <description>Configures the frame number of one GOP.\\0: The frame number of one GOP is infinite\\Others: Actual frame number of one GOP</description>
              <bitOffset>1</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>A_SYS_MB_RES</name>
          <description>Video A horizontal and vertical MB resolution register.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>A_SYS_TOTAL_MB_Y</name>
              <description>Configures video A vertical MB resolution.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A_SYS_TOTAL_MB_X</name>
              <description>Configures video A horizontal MB resolution.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>A_SYS_CONF</name>
          <description>Video A system level configuration register.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000203</resetValue>
          <fields>
            <field>
              <name>A_DB_TMP_READY_TRIGGER_MB_NUM</name>
              <description>Configures when to trigger  video A H264_DB_TMP_READY_INT. When the (MB number of written db temp+1) is greater than this filed in first MB line, trigger H264_DB_TMP_READY_INT. Min is 3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A_REC_READY_TRIGGER_MB_LINES</name>
              <description>Configures when to trigger  video A H264_REC_READY_INT. When the MB line number of generated reconstruct pixel is greater than this filed, trigger H264_REC_READY_INT. Min is 4.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A_INTRA_COST_CMP_OFFSET</name>
              <description>Configures video A intra cost offset when I MB compared with P MB.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>A_DECI_SCORE</name>
          <description>Video A luma and chroma MB decimate score Register.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>A_C_DECI_SCORE</name>
              <description>Configures video A chroma MB decimate score. When chroma score is smaller than it, chroma decimate will be enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A_L_DECI_SCORE</name>
              <description>Configures video A luma MB decimate score. When luma score is smaller than it, luma decimate will be enable.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>A_DECI_SCORE_OFFSET</name>
          <description>Video A luma and chroma MB decimate score offset Register.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>A_I16X16_DECI_SCORE_OFFSET</name>
              <description>Configures video A i16x16 MB decimate score offset. This offset will be added to i16x16 MB score.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A_I_CHROMA_DECI_SCORE_OFFSET</name>
              <description>Configures video A I chroma MB decimate score offset. This offset will be added to I chroma MB score.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A_P16X16_DECI_SCORE_OFFSET</name>
              <description>Configures video A p16x16 MB decimate score offset. This offset will be added to p16x16 MB score.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A_P_CHROMA_DECI_SCORE_OFFSET</name>
              <description>Configures video A p chroma MB decimate score offset. This offset will be added to p chroma MB score.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>A_RC_CONF0</name>
          <description>Video A rate control configuration register0.</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>A_QP</name>
              <description>Configures video A frame level initial luma QP value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A_RATE_CTRL_U</name>
              <description>Configures video A parameter U value. U = int((float) u &lt;&lt; 8).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A_MB_RATE_CTRL_EN</name>
              <description>Configures video A whether or not to open macro block rate ctrl.\\1:Open the macro block rate ctrl\\1:Close the macro block rate ctrl.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>A_RC_CONF1</name>
          <description>Video A rate control configuration register1.</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>A_CHROMA_DC_QP_DELTA</name>
              <description>Configures video A chroma DC QP offset based on Chroma QP. Chroma DC QP = Chroma QP(after map) + reg_chroma_dc_qp_delta.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A_CHROMA_QP_DELTA</name>
              <description>Configures video A chroma QP offset based on luma QP. Chroma QP(before map) = Luma QP + reg_chroma_qp_delta.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A_QP_MIN</name>
              <description>Configures video A allowed luma QP min value.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A_QP_MAX</name>
              <description>Configures video A allowed luma QP max value.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A_MAD_FRAME_PRED</name>
              <description>Configures vdieo A frame level predicted MB MAD value.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>A_DB_BYPASS</name>
          <description>Video A Deblocking bypass register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>A_BYPASS_DB_FILTER</name>
              <description>Configures whether or not to bypass video A deblcoking filter. \\0: Open the deblock filter\\1: Close the deblock filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>A_ROI_REGION0</name>
          <description>Video A H264 ROI region0 range configure register.</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>X</name>
              <description>Configures the horizontal start macroblocks of region 0 in Video A.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y</name>
              <description>Configures the  vertical start macroblocks of region 0 in Video A.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X_LEN</name>
              <description>Configures the number of  macroblocks in horizontal direction of  the region 0 in Video A.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y_LEN</name>
              <description>Configures the number of  macroblocks in vertical direction of  the region 0 in Video A.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Configures whether or not to open Video A ROI of region 0 .\\0:Close ROI\\1:Open ROI.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>A_ROI_REGION1</name>
          <description>Video A H264 ROI region1 range configure register.</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>X</name>
              <description>Configures the horizontal start macroblocks of region 1 in Video A.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y</name>
              <description>Configures the  vertical start macroblocks of region 1 in Video A.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X_LEN</name>
              <description>Configures the number of  macroblocks in horizontal direction of  the region 1 in Video A.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y_LEN</name>
              <description>Configures the number of  macroblocks in vertical direction of  the region 1 in Video A.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Configures whether or not to open Video A ROI of region 1 .\\0:Close ROI\\1:Open ROI.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>A_ROI_REGION2</name>
          <description>Video A H264 ROI region2 range configure register.</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>X</name>
              <description>Configures the horizontal start macroblocks of region 2 in Video A.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y</name>
              <description>Configures the  vertical start macroblocks of region 2 in Video A.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X_LEN</name>
              <description>Configures the number of  macroblocks in horizontal direction of  the region 2 in Video A.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y_LEN</name>
              <description>Configures the number of  macroblocks in vertical direction of  the region 2 in Video A.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Configures whether or not to open Video A ROI of region 2 .\\0:Close ROI\\1:Open ROI.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>A_ROI_REGION3</name>
          <description>Video A H264 ROI region3 range configure register.</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>X</name>
              <description>Configures the horizontal start macroblocks of region 3 in Video A.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y</name>
              <description>Configures the  vertical start macroblocks of region 3 in Video A.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X_LEN</name>
              <description>Configures the number of  macroblocks in horizontal direction of  the region 3 in video A.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y_LEN</name>
              <description>Configures the number of  macroblocks in vertical direction of  the region 3 in video A.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Configures whether or not to open Video A ROI of region 3 .\\0:Close ROI\\1:Open ROI.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>A_ROI_REGION4</name>
          <description>Video A H264 ROI region4 range configure register.</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>X</name>
              <description>Configures the horizontal start macroblocks of region 4 in Video A.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y</name>
              <description>Configures the  vertical start macroblocks of region 4 in Video A.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X_LEN</name>
              <description>Configures the number of  macroblocks in horizontal direction of  the region 4 in video A.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y_LEN</name>
              <description>Configures the number of  macroblocks in vertical direction of  the region 4 in video A.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Configures whether or not to open Video A ROI of region 4 .\\0:Close ROI\\1:Open ROI.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>A_ROI_REGION5</name>
          <description>Video A H264 ROI region5 range configure register.</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>X</name>
              <description>Configures the horizontial start macroblocks of region 5 video A.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y</name>
              <description>Configures the  vertical start macroblocks of region 5 video A.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X_LEN</name>
              <description>Configures the number of  macroblocks in horizontal direction of  the region 5 video A.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y_LEN</name>
              <description>Configures the number of  macroblocks in vertical direction of  the region 5 in video A.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Configures whether or not to open Video A ROI of region 5 .\\0:Close ROI\\1:Open ROI.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
