seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
        <register>
          <name>A_ROI_REGION6</name>
          <description>Video A H264 ROI region6 range configure register.</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>X</name>
              <description>Configures the horizontial start macroblocks of region 6 video A.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y</name>
              <description>Configures the  vertical start macroblocks of region 6 in video A.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X_LEN</name>
              <description>Configures the number of  macroblocks in horizontal direction of  the region 6 in video A.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y_LEN</name>
              <description>Configures the number of  macroblocks in vertical direction of  the region 6 in video A.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Configures whether or not to open Video A ROI of region 6 .\\0:Close ROI\\1:Open ROI.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>A_ROI_REGION7</name>
          <description>Video A H264 ROI region7 range configure register.</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>X</name>
              <description>Configures the horizontal start macroblocks of region 7 in video A.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y</name>
              <description>Configures the  vertical start macroblocks of region 7 in video A.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X_LEN</name>
              <description>Configures the number of  macroblocks in horizontal direction of  the region 7 in video A.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y_LEN</name>
              <description>Configures the number of  macroblocks in vertical direction of  the region 7 in video A.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Configures whether or not to open Video A ROI of region 7 .\\0:Close ROI\\1:Open ROI.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>A_ROI_REGION0_3_QP</name>
          <description>Video A H264 ROI region0, region1,region2,region3 QP register.</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>A_ROI_REGION0_QP</name>
              <description>Configure H264 ROI region0 qp in video A,fixed qp or delta qp.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A_ROI_REGION1_QP</name>
              <description>Configure H264 ROI region1 qp in video A,fixed qp or delta qp.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A_ROI_REGION2_QP</name>
              <description>Configure H264 ROI region2 qp in video A,fixed qp or delta qp.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A_ROI_REGION3_QP</name>
              <description>Configure H264 ROI region3 qp in video A,fixed qp or delta qp.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>A_ROI_REGION4_7_QP</name>
          <description>Video A H264 ROI region4, region5,region6,region7 QP register.</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>A_ROI_REGION4_QP</name>
              <description>Configure H264 ROI region4 qp in video A,fixed qp or delta qp.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A_ROI_REGION5_QP</name>
              <description>Configure H264 ROI region5 qp in video A,fixed qp or delta qp.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A_ROI_REGION6_QP</name>
              <description>Configure H264 ROI region6 qp in video A,fixed qp or delta qp.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A_ROI_REGION7_QP</name>
              <description>Configure H264 ROI region7 qp in video A,fixed qp or delta qp.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>A_NO_ROI_REGION_QP_OFFSET</name>
          <description>Video A H264 no roi region QP register.</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>A_NO_ROI_REGION_QP</name>
              <description>Configure H264 no region qp in video A, delta qp.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>A_ROI_CONFIG</name>
          <description>Video A H264 ROI configure register.</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>A_ROI_EN</name>
              <description>Configure whether or not to enable ROI in video A.\\0:not enable ROI\\1:enable ROI.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A_ROI_MODE</name>
              <description>Configure the mode of ROI in video A.\\0:fixed qp\\1:delta qp.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B_SYS_MB_RES</name>
          <description>Video B horizontal and vertical MB resolution register.</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>B_SYS_TOTAL_MB_Y</name>
              <description>Configures video B vertical MB resolution.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B_SYS_TOTAL_MB_X</name>
              <description>Configures video B horizontal MB resolution.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B_SYS_CONF</name>
          <description>Video B system level configuration register.</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000203</resetValue>
          <fields>
            <field>
              <name>B_DB_TMP_READY_TRIGGER_MB_NUM</name>
              <description>Configures when to trigger  video B H264_DB_TMP_READY_INT. When the (MB number of written db temp+1) is greater than this filed in first MB line, trigger H264_DB_TMP_READY_INT. Min is 3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B_REC_READY_TRIGGER_MB_LINES</name>
              <description>Configures when to trigger  video B H264_REC_READY_INT. When the MB line number of generated reconstruct pixel is greater than this filed, trigger H264_REC_READY_INT. Min is 4.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B_INTRA_COST_CMP_OFFSET</name>
              <description>Configures video B intra cost offset when I MB compared with P MB.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B_DECI_SCORE</name>
          <description>Video B luma and chroma MB decimate score Register.</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>B_C_DECI_SCORE</name>
              <description>Configures video B chroma MB decimate score. When chroma score is smaller than it, chroma decimate will be enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B_L_DECI_SCORE</name>
              <description>Configures video B luma MB decimate score. When luma score is smaller than it, luma decimate will be enable.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B_DECI_SCORE_OFFSET</name>
          <description>Video B luma and chroma MB decimate score offset Register.</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>B_I16X16_DECI_SCORE_OFFSET</name>
              <description>Configures video B i16x16 MB decimate score offset. This offset will be added to i16x16 MB score.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B_I_CHROMA_DECI_SCORE_OFFSET</name>
              <description>Configures video B I chroma MB decimate score offset. This offset will be added to I chroma MB score.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B_P16X16_DECI_SCORE_OFFSET</name>
              <description>Configures video B p16x16 MB decimate score offset. This offset will be added to p16x16 MB score.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B_P_CHROMA_DECI_SCORE_OFFSET</name>
              <description>Configures video B p chroma MB decimate score offset. This offset will be added to p chroma MB score.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B_RC_CONF0</name>
          <description>Video B rate control configuration register0.</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>B_QP</name>
              <description>Configures video B frame level initial luma QP value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B_RATE_CTRL_U</name>
              <description>Configures video B parameter U value. U = int((float) u &lt;&lt; 8).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B_MB_RATE_CTRL_EN</name>
              <description>Configures video A whether or not to open macro block rate ctrl.\\1:Open the macro block rate ctrl\\1:Close the macro block rate ctrl.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B_RC_CONF1</name>
          <description>Video B rate control configuration register1.</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>B_CHROMA_DC_QP_DELTA</name>
              <description>Configures video B chroma DC QP offset based on Chroma QP. Chroma DC QP = Chroma QP(after map) + reg_chroma_dc_qp_delta.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B_CHROMA_QP_DELTA</name>
              <description>Configures video B chroma QP offset based on luma QP. Chroma QP(before map) = Luma QP + reg_chroma_qp_delta.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B_QP_MIN</name>
              <description>Configures video B allowed luma QP min value.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B_QP_MAX</name>
              <description>Configures video B allowed luma QP max value.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B_MAD_FRAME_PRED</name>
              <description>Configures vdieo B frame level predicted MB MAD value.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B_DB_BYPASS</name>
          <description>Video B Deblocking bypass register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>B_BYPASS_DB_FILTER</name>
              <description>Configures whether or not to bypass video B deblcoking filter. \\0: Open the deblock filter\\1: Close the deblock filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B_ROI_REGION0</name>
          <description>Video B H264 ROI region0 range configure register.</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>X</name>
              <description>Configures the horizontal start macroblocks of region 0 in Video B.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y</name>
              <description>Configures the  vertical start macroblocks of region 0 in Video B.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X_LEN</name>
              <description>Configures the number of  macroblocks in horizontal direction of  the region 0 in Video B.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y_LEN</name>
              <description>Configures the number of  macroblocks in vertical direction of  the region 0 in Video B.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Configures whether or not to open Video B ROI of region 0 .\\0:Close ROI\\1:Open ROI.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B_ROI_REGION1</name>
          <description>Video B H264 ROI region1 range configure register.</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>X</name>
              <description>Configures the horizontal start macroblocks of region 1 in Video B.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y</name>
              <description>Configures the  vertical start macroblocks of region 1 in Video B.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X_LEN</name>
              <description>Configures the number of  macroblocks in horizontal direction of  the region 1 in Video B.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y_LEN</name>
              <description>Configures the number of  macroblocks in vertical direction of  the region 1 in Video B.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Configures whether or not to open Video B ROI of region 1 .\\0:Close ROI\\1:Open ROI.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B_ROI_REGION2</name>
          <description>Video B H264 ROI region2 range configure register.</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>X</name>
              <description>Configures the horizontal start macroblocks of region 2 in Video B.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y</name>
              <description>Configures the  vertical start macroblocks of region 2 in Video B.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X_LEN</name>
              <description>Configures the number of  macroblocks in horizontal direction of  the region 2 in Video B.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y_LEN</name>
              <description>Configures the number of  macroblocks in vertical direction of  the region 2 in Video B.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Configures whether or not to open Video B ROI of region 2 .\\0:Close ROI\\1:Open ROI.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
