seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
        <register>
          <name>DEBUG_INFO2</name>
          <description>Debug information register2.</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>P_RC_DONE_DEBUG_FLAG</name>
              <description>Represents p rate ctrl done status.\\0: not done\\1: done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P_P_I_CMP_DONE_DEBUG_FLAG</name>
              <description>Represents p p_i_cmp done status.\\0: not done\\1: done.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P_MV_MERGE_DONE_DEBUG_FLAG</name>
              <description>Represents p mv merge done status.\\0: not done\\1: done.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P_MOVE_ORI_DONE_DEBUG_FLAG</name>
              <description>Represents p move origin done status.\\0: not done\\1: done.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P_MC_DONE_DEBUG_FLAG</name>
              <description>Represents p mc done status.\\0: not done\\1: done.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P_IME_DONE_DEBUG_FLAG</name>
              <description>Represents p ime done status.\\0: not done\\1: done.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P_GET_ORI_DONE_DEBUG_FLAG</name>
              <description>Represents p get origin done status.\\0: not done\\1: done.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P_FME_DONE_DEBUG_FLAG</name>
              <description>Represents p fme done status.\\0: not done\\1: done.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P_FETCH_DONE_DEBUG_FLAG</name>
              <description>Represents p fetch done status.\\0: not done\\1: done.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P_DB_DONE_DEBUG_FLAG</name>
              <description>Represents p deblocking done status.\\0: not done\\1: done.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P_BS_BUF_DONE_DEBUG_FLAG</name>
              <description>Represents p bitstream buffer done status.\\0: not done\\1: done.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REF_MOVE_2MB_LINE_DONE_DEBUG_FLAG</name>
              <description>Represents dma move 2 ref mb line done status.\\0: not done\\1: done.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>I_P_I_CMP_DONE_DEBUG_FLAG</name>
              <description>Represents I p_i_cmp done status.\\0: not done\\1: done.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>I_MOVE_ORI_DONE_DEBUG_FLAG</name>
              <description>Represents I move origin done status.\\0: not done\\1: done.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>I_GET_ORI_DONE_DEBUG_FLAG</name>
              <description>Represents I get origin done status.\\0: not done\\1: done.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>I_EC_DONE_DEBUG_FLAG</name>
              <description>Represents I encoder done status.\\0: not done\\1: done.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>I_DB_DONE_DEBUG_FLAG</name>
              <description>Represents I deblocking done status.\\0: not done\\1: done.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>I_BS_BUF_DONE_DEBUG_FLAG</name>
              <description>Represents I bitstream buffer done status.\\0: not done\\1: done.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <resetValue>0x02304240</resetValue>
          <fields>
            <field>
              <name>LEDC_DATE</name>
              <description>Configures the version.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
