seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
        <register>
          <name>IN_POP_CH0</name>
          <description>RX CH0 INFIFO pop register</description>
          <addressOffset>0x518</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000400</resetValue>
          <fields>
            <field>
              <name>INFIFO_RDATA_CH0</name>
              <description>This register stores the data popping from DMA Rx FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_POP_CH0</name>
              <description>Set this bit to pop data from DMA Rx FIFO.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_LINK_CONF_CH0</name>
          <description>RX CH0 in_link dscr ctrl register</description>
          <addressOffset>0x51C</addressOffset>
          <size>0x20</size>
          <resetValue>0x01100000</resetValue>
          <fields>
            <field>
              <name>INLINK_AUTO_RET_CH0</name>
              <description>Set this bit to return to current inlink descriptor's address, when there are some errors in current receiving data.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INLINK_STOP_CH0</name>
              <description>Set this bit to stop dealing with the inlink descriptors.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INLINK_START_CH0</name>
              <description>Set this bit to start dealing with the inlink descriptors.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INLINK_RESTART_CH0</name>
              <description>Set this bit to mount a new inlink descriptor.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INLINK_PARK_CH0</name>
              <description>1: the inlink descriptor's FSM is in idle state.  0: the inlink descriptor's FSM is working.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_LINK_ADDR_CH0</name>
          <description>RX CH0 in_link dscr addr register</description>
          <addressOffset>0x520</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INLINK_ADDR_CH0</name>
              <description>This register stores the first inlink descriptor's address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_STATE_CH0</name>
          <description>RX CH0 state register</description>
          <addressOffset>0x524</addressOffset>
          <size>0x20</size>
          <resetValue>0x00800000</resetValue>
          <fields>
            <field>
              <name>INLINK_DSCR_ADDR_CH0</name>
              <description>This register stores the current inlink descriptor's address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_DSCR_STATE_CH0</name>
              <description>This register stores the current descriptor state machine state.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_STATE_CH0</name>
              <description>This register stores the current control module state machine state.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_RESET_AVAIL_CH0</name>
              <description>This register indicate that if the channel reset is safety.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_SUC_EOF_DES_ADDR_CH0</name>
          <description>RX CH0 eof des addr register</description>
          <addressOffset>0x528</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN_SUC_EOF_DES_ADDR_CH0</name>
              <description>This register stores the address of the inlink descriptor when the EOF bit in this descriptor is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_ERR_EOF_DES_ADDR_CH0</name>
          <description>RX CH0 err eof des addr register</description>
          <addressOffset>0x52C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN_ERR_EOF_DES_ADDR_CH0</name>
              <description>This register stores the address of the inlink descriptor when there are some errors in current receiving data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_DSCR_CH0</name>
          <description>RX CH0 next dscr addr register</description>
          <addressOffset>0x530</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INLINK_DSCR_CH0</name>
              <description>The address of the next inlink descriptor address x.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_DSCR_BF0_CH0</name>
          <description>RX CH0 last dscr addr register</description>
          <addressOffset>0x534</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INLINK_DSCR_BF0_CH0</name>
              <description>The address of the last inlink descriptor's next address x-1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_DSCR_BF1_CH0</name>
          <description>RX CH0 second-to-last dscr addr register</description>
          <addressOffset>0x538</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INLINK_DSCR_BF1_CH0</name>
              <description>The address of the second-to-last inlink descriptor's next address x-2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_ARB_CH0</name>
          <description>RX CH0 arb register</description>
          <addressOffset>0x540</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000051</resetValue>
          <fields>
            <field>
              <name>IN_ARB_TOKEN_NUM_CH0</name>
              <description>Set the max number of token count of arbiter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTER_IN_ARB_PRIORITY_CH0</name>
              <description>Set the priority of channel</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTER_IN_ARB_PRIORITY_CH0</name>
              <description>Set the priority of channel</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_RO_PD_CONF_CH0</name>
          <description>RX CH0 reorder power config register</description>
          <addressOffset>0x548</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN_RO_RAM_CLK_FO_CH0</name>
              <description>1: Force to open the clock and bypass the gate-clock when accessing the RAM in DMA. 0: A gate-clock will be used when accessing the RAM in DMA.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_ETM_CONF_CH0</name>
          <description>RX CH0 ETM config register</description>
          <addressOffset>0x56C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>IN_ETM_EN_CH0</name>
              <description>Set this bit to 1 to enable ETM task function</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_ETM_LOOP_EN_CH0</name>
              <description>when this bit is 1, dscr can be processed after receiving a task</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_TASK_MAK_CH0</name>
              <description>ETM dscr_ready maximum cache numbers</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_FIFO_CNT_CH0</name>
          <description>rx CH0 fifo cnt register</description>
          <addressOffset>0x580</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN_CMDFIFO_INFIFO_CNT_CH0</name>
              <description>only for debug</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_POP_DATA_CNT_CH0</name>
          <description>rx CH0 pop data cnt register</description>
          <addressOffset>0x584</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>IN_CMDFIFO_POP_DATA_CNT_CH0</name>
              <description>only for debug</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_XADDR_CH0</name>
          <description>rx CH0 xaddr register</description>
          <addressOffset>0x588</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN_CMDFIFO_XADDR_CH0</name>
              <description>only for debug</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_BUF_HB_RCV_CH0</name>
          <description>rx CH0 buf len hb rcv register</description>
          <addressOffset>0x58C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN_CMDFIFO_BUF_HB_RCV_CH0</name>
              <description>only for debug</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_CONF0_CH1</name>
          <description>RX CH1 config0 register</description>
          <addressOffset>0x600</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INDSCR_BURST_EN_CH1</name>
              <description>Set this bit to 1 to enable INCR burst transfer for Rx transmitting link descriptor when accessing SRAM.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_ECC_AES_EN_CH1</name>
              <description>When access address space is ecc/aes area, this bit should be set to 1. In this case, the start address of square should be 16-bit aligned. The width of square multiply byte number of one pixel should be 16-bit aligned.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_CHECK_OWNER_CH1</name>
              <description>Set this bit to enable checking the owner attribute of the link descriptor.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_MEM_BURST_LENGTH_CH1</name>
              <description>Block size of Rx channel 1. 0: single      1: 16 bytes      2: 32 bytes    3: 64 bytes    4: 128 bytes</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_PAGE_BOUND_EN_CH1</name>
              <description>Set this bit to 1 to make sure AXI write data don't cross the address boundary which define by mem_burst_length</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_RST_CH1</name>
              <description>Write 1 then write 0 to this bit to reset Rx channel</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_CMD_DISABLE_CH1</name>
              <description>Write 1 before reset and write 0 after reset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_ARB_WEIGHT_OPT_DIS_CH1</name>
              <description>Set this bit to 1 to disable arbiter optimum weight function.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_INT_RAW_CH1</name>
          <description>RX CH1  interrupt raw register</description>
          <addressOffset>0x604</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN_DONE_CH1_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been transmitted to peripherals for Rx channel 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH1_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been received and no data error is detected for Rx channel 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH1_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been received and data error is detected</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH1_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when detecting inlink descriptor error, including owner error, the second and third word error of inlink descriptor for Rx channel 1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_OVF_L1_CH1_INT_RAW</name>
              <description>This raw interrupt bit turns to high level when fifo of Rx channel is overflow.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_UDF_L1_CH1_INT_RAW</name>
              <description>This raw interrupt bit turns to high level when fifo of Rx channel is underflow.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_OVF_L2_CH1_INT_RAW</name>
              <description>This raw interrupt bit turns to high level when fifo of Rx channel is overflow.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_UDF_L2_CH1_INT_RAW</name>
              <description>This raw interrupt bit turns to high level when fifo of Rx channel is underflow.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH1_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when the last descriptor is done but fifo also remain data.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_TASK_OVF_CH1_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when dscr ready task fifo is overflow.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_INT_ENA_CH1</name>
          <description>RX CH1  interrupt ena register</description>
          <addressOffset>0x608</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN_DONE_CH1_INT_ENA</name>
              <description>The interrupt enable bit for the IN_DONE_CH_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH1_INT_ENA</name>
              <description>The interrupt enable bit for the IN_SUC_EOF_CH_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH1_INT_ENA</name>
              <description>The interrupt enable bit for the IN_ERR_EOF_CH_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH1_INT_ENA</name>
              <description>The interrupt enable bit for the IN_DSCR_ERR_CH_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_OVF_L1_CH1_INT_ENA</name>
              <description>The interrupt enable bit for the INFIFO_OVF_L1_CH_INT interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_UDF_L1_CH1_INT_ENA</name>
              <description>The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_OVF_L2_CH1_INT_ENA</name>
              <description>The interrupt enable bit for the INFIFO_OVF_L2_CH_INT interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_UDF_L2_CH1_INT_ENA</name>
              <description>The interrupt enable bit for the INFIFO_UDF_L2_CH_INT interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH1_INT_ENA</name>
              <description>The interrupt enable bit for the IN_DSCR_EMPTY_CH_INT interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_TASK_OVF_CH1_INT_ENA</name>
              <description>The interrupt enable bit for the IN_DSCR_TASK_OVF_CH_INT interrupt.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
