seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
        <register>
          <name>INTER_AXI_ERR</name>
          <description>inter memory axi err register</description>
          <addressOffset>0xB00</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INTER_RID_ERR_CNT</name>
              <description>AXI read id err cnt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTER_RRESP_ERR_CNT</name>
              <description>AXI read resp err cnt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTER_WRESP_ERR_CNT</name>
              <description>AXI write resp err cnt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTER_RD_FIFO_CNT</name>
              <description>AXI read cmd fifo remain cmd count</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTER_RD_BAK_FIFO_CNT</name>
              <description>AXI read backup cmd fifo remain cmd count</description>
              <bitOffset>15</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTER_WR_FIFO_CNT</name>
              <description>AXI write cmd fifo remain cmd count</description>
              <bitOffset>19</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTER_WR_BAK_FIFO_CNT</name>
              <description>AXI write backup cmd fifo remain cmd count</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTER_AXI_ERR</name>
          <description>exter memory axi err register</description>
          <addressOffset>0xB04</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EXTER_RID_ERR_CNT</name>
              <description>AXI read id err cnt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTER_RRESP_ERR_CNT</name>
              <description>AXI read resp err cnt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTER_WRESP_ERR_CNT</name>
              <description>AXI write resp err cnt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTER_RD_FIFO_CNT</name>
              <description>AXI read cmd fifo remain cmd count</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTER_RD_BAK_FIFO_CNT</name>
              <description>AXI read backup cmd fifo remain cmd count</description>
              <bitOffset>15</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTER_WR_FIFO_CNT</name>
              <description>AXI write cmd fifo remain cmd count</description>
              <bitOffset>19</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTER_WR_BAK_FIFO_CNT</name>
              <description>AXI write backup cmd fifo remain cmd count</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RST_CONF</name>
          <description>axi reset config register</description>
          <addressOffset>0xB08</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INTER_AXIM_RD_RST</name>
              <description>Write 1 then write 0  to this bit to reset axi master read data FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTER_AXIM_WR_RST</name>
              <description>Write 1 then write 0  to this bit to reset axi master write data FIFO.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTER_AXIM_RD_RST</name>
              <description>Write 1 then write 0  to this bit to reset axi master read data FIFO.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTER_AXIM_WR_RST</name>
              <description>Write 1 then write 0  to this bit to reset axi master write data FIFO.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>1'h1: Force clock on for register. 1'h0: Support clock only when application writes registers.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTER_MEM_START_ADDR0</name>
          <description>Start address of inter memory range0 register</description>
          <addressOffset>0xB0C</addressOffset>
          <size>0x20</size>
          <resetValue>0x30100000</resetValue>
          <fields>
            <field>
              <name>ACCESS_INTER_MEM_START_ADDR0</name>
              <description>The start address of accessible address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTER_MEM_END_ADDR0</name>
          <description>end address of inter memory range0 register</description>
          <addressOffset>0xB10</addressOffset>
          <size>0x20</size>
          <resetValue>0x8FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ACCESS_INTER_MEM_END_ADDR0</name>
              <description>The end address of accessible address space. The access address beyond this range would lead to descriptor error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTER_MEM_START_ADDR1</name>
          <description>Start address of inter memory range1 register</description>
          <addressOffset>0xB14</addressOffset>
          <size>0x20</size>
          <resetValue>0x30100000</resetValue>
          <fields>
            <field>
              <name>ACCESS_INTER_MEM_START_ADDR1</name>
              <description>The start address of accessible address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTER_MEM_END_ADDR1</name>
          <description>end address of inter memory range1 register</description>
          <addressOffset>0xB18</addressOffset>
          <size>0x20</size>
          <resetValue>0x8FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ACCESS_INTER_MEM_END_ADDR1</name>
              <description>The end address of accessible address space. The access address beyond this range would lead to descriptor error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTER_MEM_START_ADDR0</name>
          <description>Start address of exter memory range0 register</description>
          <addressOffset>0xB20</addressOffset>
          <size>0x20</size>
          <resetValue>0x30100000</resetValue>
          <fields>
            <field>
              <name>ACCESS_EXTER_MEM_START_ADDR0</name>
              <description>The start address of accessible address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTER_MEM_END_ADDR0</name>
          <description>end address of exter memory range0 register</description>
          <addressOffset>0xB24</addressOffset>
          <size>0x20</size>
          <resetValue>0x8FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ACCESS_EXTER_MEM_END_ADDR0</name>
              <description>The end address of accessible address space. The access address beyond this range would lead to descriptor error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTER_MEM_START_ADDR1</name>
          <description>Start address of exter memory range1 register</description>
          <addressOffset>0xB28</addressOffset>
          <size>0x20</size>
          <resetValue>0x30100000</resetValue>
          <fields>
            <field>
              <name>ACCESS_EXTER_MEM_START_ADDR1</name>
              <description>The start address of accessible address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTER_MEM_END_ADDR1</name>
          <description>end address of exter memory range1 register</description>
          <addressOffset>0xB2C</addressOffset>
          <size>0x20</size>
          <resetValue>0x8FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ACCESS_EXTER_MEM_END_ADDR1</name>
              <description>The end address of accessible address space. The access address beyond this range would lead to descriptor error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_ARB_CONFIG</name>
          <description>reserved</description>
          <addressOffset>0xB30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OUT_ARB_TIMEOUT_NUM</name>
              <description>Set the max number of timeout count of arbiter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_WEIGHT_EN</name>
              <description>reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_ARB_CONFIG</name>
          <description>reserved</description>
          <addressOffset>0xB34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN_ARB_TIMEOUT_NUM</name>
              <description>Set the max number of timeout count of arbiter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_WEIGHT_EN</name>
              <description>reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>reserved</description>
          <addressOffset>0xB3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x20230403</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>register version.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COUNTER_RST</name>
          <description>counter reset register</description>
          <addressOffset>0xB50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_CH0_EXTER_COUNTER_RST</name>
              <description>Write 1 then write 0 to this bit to reset rx ch0 counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CH1_EXTER_COUNTER_RST</name>
              <description>Write 1 then write 0 to this bit to reset rx ch1 counter.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CH2_INTER_COUNTER_RST</name>
              <description>Write 1 then write 0 to this bit to reset rx ch2 counter.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CH5_INTER_COUNTER_RST</name>
              <description>Write 1 then write 0 to this bit to reset rx ch5 counter.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CH0_COUNTER</name>
          <description>rx ch0 counter register</description>
          <addressOffset>0xB54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_CH0_CNT</name>
              <description>rx ch0 counter register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CH1_COUNTER</name>
          <description>rx ch1 counter register</description>
          <addressOffset>0xB58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_CH1_CNT</name>
              <description>rx ch1 counter register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CH2_COUNTER</name>
          <description>rx ch2 counter register</description>
          <addressOffset>0xB5C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_CH2_CNT</name>
              <description>rx ch2 counter register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CH5_COUNTER</name>
          <description>rx ch5 counter register</description>
          <addressOffset>0xB60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_CH5_CNT</name>
              <description>rx ch5 counter register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
