seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
        <register>
          <name>CORE_TIMEOUT_INT_ST</name>
          <description>masked interrupt register</description>
          <addressOffset>0x1AC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE0_AHB_TIMEOUT_INT_ST</name>
              <description>the masked interrupt status of hp core0  ahb timeout</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE1_AHB_TIMEOUT_INT_ST</name>
              <description>the masked interrupt status of hp core1  ahb timeout</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE0_IBUS_TIMEOUT_INT_ST</name>
              <description>the masked interrupt status of hp core0  ibus timeout</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE1_IBUS_TIMEOUT_INT_ST</name>
              <description>the masked interrupt status of hp core1  ibus timeout</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE0_DBUS_TIMEOUT_INT_ST</name>
              <description>the masked interrupt status of hp core0  dbus timeout</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE1_DBUS_TIMEOUT_INT_ST</name>
              <description>the masked interrupt status of hp core1  dbus timeout</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_TIMEOUT_INT_ENA</name>
          <description>masked interrupt register</description>
          <addressOffset>0x1B0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE0_AHB_TIMEOUT_INT_ENA</name>
              <description>Write 1 to enable hp_core0_ahb_timeout int</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_AHB_TIMEOUT_INT_ENA</name>
              <description>Write 1 to enable hp_core1_ahb_timeout int</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_IBUS_TIMEOUT_INT_ENA</name>
              <description>Write 1 to enable hp_core0_ibus_timeout int</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_IBUS_TIMEOUT_INT_ENA</name>
              <description>Write 1 to enable hp_core1_ibus_timeout int</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_DBUS_TIMEOUT_INT_ENA</name>
              <description>Write 1 to enable hp_core0_dbus_timeout int</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_DBUS_TIMEOUT_INT_ENA</name>
              <description>Write 1 to enable hp_core1_dbus_timeout int</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_TIMEOUT_INT_CLR</name>
          <description>interrupt clear register</description>
          <addressOffset>0x1B4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE0_AHB_TIMEOUT_INT_CLR</name>
              <description>Write 1 to clear hp_core0_ahb_timeout int</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE1_AHB_TIMEOUT_INT_CLR</name>
              <description>Write 1 to clear hp_core1_ahb_timeout int</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE0_IBUS_TIMEOUT_INT_CLR</name>
              <description>Write 1 to clear hp_core0_ibus_timeout int</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE1_IBUS_TIMEOUT_INT_CLR</name>
              <description>Write 1 to clear hp_core1_ibus_timeout int</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE0_DBUS_TIMEOUT_INT_CLR</name>
              <description>Write 1 to clear hp_core0_dbus_timeout int</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE1_DBUS_TIMEOUT_INT_CLR</name>
              <description>Write 1 to clear hp_core1_dbus_timeout int</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_O_HYS_CTRL0</name>
          <description>NA</description>
          <addressOffset>0x1C0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REG_GPIO_0_HYS_LOW</name>
              <description>hys control for gpio47~16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_O_HYS_CTRL1</name>
          <description>NA</description>
          <addressOffset>0x1C4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REG_GPIO_0_HYS_HIGH</name>
              <description>hys control for gpio56~48</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSA_PD_CTRL</name>
          <description>rsa pd ctrl register</description>
          <addressOffset>0x1D0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>RSA_MEM_FORCE_PD</name>
              <description>Set this bit to power down rsa internal memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSA_MEM_FORCE_PU</name>
              <description>Set this bit to force power up rsa internal memory</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSA_MEM_PD</name>
              <description>Set this bit to force power down rsa internal memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PD_CTRL</name>
          <description>ecc pd ctrl register</description>
          <addressOffset>0x1D4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>ECC_MEM_FORCE_PD</name>
              <description>Set this bit to power down ecc internal memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_MEM_FORCE_PU</name>
              <description>Set this bit to force power up ecc internal memory</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_MEM_PD</name>
              <description>Set this bit to force power down ecc internal memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_CFG</name>
          <description>rng cfg register</description>
          <addressOffset>0x1D8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RNG_SAMPLE_ENABLE</name>
              <description>enable rng sample chain</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RNG_CHAIN_CLK_DIV_NUM</name>
              <description>chain clk div num to pad for debug</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RNG_SAMPLE_CNT</name>
              <description>debug rng sample cnt</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_PD_CTRL</name>
          <description>ecc pd ctrl register</description>
          <addressOffset>0x1DC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>UART_MEM_FORCE_PD</name>
              <description>Set this bit to power down hp uart internal memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_MEM_FORCE_PU</name>
              <description>Set this bit to force power up hp uart  internal memory</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PERI_MEM_CLK_FORCE_ON</name>
          <description>hp peri mem clk force on regpster</description>
          <addressOffset>0x1E0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RMT_MEM_CLK_FORCE_ON</name>
              <description>Set this bit to force on mem clk in rmt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BITSCRAMBLER_TX_MEM_CLK_FORCE_ON</name>
              <description>Set this bit to force on tx mem clk in bitscrambler</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BITSCRAMBLER_RX_MEM_CLK_FORCE_ON</name>
              <description>Set this bit to force on rx mem clk in bitscrambler</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GDMA_MEM_CLK_FORCE_ON</name>
              <description>Set this bit to force on mem clk in gdma</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
