seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
        <register>
          <name>HPWDT_CORE1_RST_CTRL0</name>
          <description>Reserved</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00001011</resetValue>
          <fields>
            <field>
              <name>REG_HPCORE1_STALL_EN</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_HPCORE1_STALL_WAIT_NUM</name>
              <description>Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_WDT_HPCORE1_RST_LEN</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_SRC_FREQ0</name>
          <description>CPU Source Frequency</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REG_CPU_SRC_FREQ</name>
              <description>cpu source clock frequency, step by 0.25MHz</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_CLK_STATUS0</name>
          <description>CPU Clock Status</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REG_ASIC_OR_FPGA</name>
              <description>0: ASIC mode, 1: FPGA mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_CPU_DIV_EFFECT</name>
              <description>0: Divider bypass, 1: Divider takes effect</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_CPU_SRC_IS_CPLL</name>
              <description>0: CPU source isn't cpll_400m, 1: CPU Source is cll_400m</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_CPU_DIV_NUM_CUR</name>
              <description>cpu current div number</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_CPU_DIV_NUMERATOR_CUR</name>
              <description>cpu current div numerator</description>
              <bitOffset>11</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_CPU_DIV_DENOMINATOR_CUR</name>
              <description>cpu current div denominator</description>
              <bitOffset>19</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_CLK_CTRL0</name>
          <description>Reserved</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <resetValue>0x03FFFFFF</resetValue>
          <fields>
            <field>
              <name>REG_DBG_CH0_SEL</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DBG_CH1_SEL</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DBG_CH2_SEL</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DBG_CH0_DIV_NUM</name>
              <description>Reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_CLK_CTRL1</name>
          <description>Reserved</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000303</resetValue>
          <fields>
            <field>
              <name>REG_DBG_CH1_DIV_NUM</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DBG_CH2_DIV_NUM</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DBG_CH0_EN</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DBG_CH1_EN</name>
              <description>Reserved</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DBG_CH2_EN</name>
              <description>Reserved</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPCORE_WDT_RESET_SOURCE0</name>
          <description>Reserved</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>REG_HPCORE0_WDT_RESET_SOURCE_SEL</name>
              <description>1'b0: use wdt0 to reset hpcore0, 1'b1: use wdt1 to reset hpcore0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_HPCORE1_WDT_RESET_SOURCE_SEL</name>
              <description>1'b0: use wdt0 to reset hpcore1, 1'b1: use wdt1 to reset hpcore1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
