seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
        <register>
          <name>SCL_I3C_MST_OD_TIME</name>
          <description>NA</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0x00050019</resetValue>
          <fields>
            <field>
              <name>REG_I3C_MST_OD_LOW_PERIOD</name>
              <description>SCL Open-Drain low count for I3C transfers targeted to I3C devices.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_I3C_MST_OD_HIGH_PERIOD</name>
              <description>SCL Open-Drain High count for I3C transfers targeted to I3C devices.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCL_I3C_MST_PP_TIME</name>
          <description>NA</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x00050005</resetValue>
          <fields>
            <field>
              <name>REG_I3C_MST_PP_LOW_PERIOD</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_I3C_MST_PP_HIGH_PERIOD</name>
              <description>NA</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCL_I2C_FM_TIME</name>
          <description>NA</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x004B00A3</resetValue>
          <fields>
            <field>
              <name>REG_I2C_FM_LOW_PERIOD</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_I2C_FM_HIGH_PERIOD</name>
              <description>The SCL open-drain low count timing for I2C Fast Mode transfers.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCL_I2C_FMP_TIME</name>
          <description>NA</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <resetValue>0x0021003F</resetValue>
          <fields>
            <field>
              <name>REG_I2C_FMP_LOW_PERIOD</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_I2C_FMP_HIGH_PERIOD</name>
              <description>NA</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCL_EXT_LOW_TIME</name>
          <description>NA</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REG_I3C_MST_EXT_LOW_PERIOD1</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_I3C_MST_EXT_LOW_PERIOD2</name>
              <description>NA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_I3C_MST_EXT_LOW_PERIOD3</name>
              <description>NA</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_I3C_MST_EXT_LOW_PERIOD4</name>
              <description>NA</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDA_SAMPLE_TIME</name>
          <description>NA</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REG_SDA_OD_SAMPLE_TIME</name>
              <description>It is used to adjust sda sample point when scl high under open drain speed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_SDA_PP_SAMPLE_TIME</name>
              <description>It is used to adjust sda sample point when scl high under push pull speed</description>
              <bitOffset>9</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDA_HOLD_TIME</name>
          <description>NA</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>REG_SDA_OD_TX_HOLD_TIME</name>
              <description>It is used to adjust sda drive point after scl neg under open drain speed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_SDA_PP_TX_HOLD_TIME</name>
              <description>It is used to adjust sda dirve point after scl neg under push pull speed</description>
              <bitOffset>9</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCL_START_HOLD</name>
          <description>NA</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>REG_SCL_START_HOLD_TIME</name>
              <description>I2C_SCL_START_HOLD_TIME</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_START_DET_HOLD_TIME</name>
              <description>NA</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCL_RSTART_SETUP</name>
          <description>NA</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>REG_SCL_RSTART_SETUP_TIME</name>
              <description>I2C_SCL_RSTART_SETUP_TIME</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCL_STOP_HOLD</name>
          <description>NA</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>REG_SCL_STOP_HOLD_TIME</name>
              <description>I2C_SCL_STOP_HOLD_TIME</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCL_STOP_SETUP</name>
          <description>NA</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>REG_SCL_STOP_SETUP_TIME</name>
              <description>I2C_SCL_STOP_SETUP_TIME</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS_FREE_TIME</name>
          <description>NA</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>REG_BUS_FREE_TIME</name>
              <description>I3C Bus Free Count Value. This field is used only in Master mode. In pure Bus System, this field represents tCAS.  In Mixed Bus System, this field is expected to be programmed to tLOW of I2C Timing.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCL_TERMN_T_EXT_LOW_TIME</name>
          <description>NA</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>REG_I3C_MST_TERMN_T_EXT_LOW_TIME</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VER_ID</name>
          <description>NA</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <resetValue>0x20230504</resetValue>
          <fields>
            <field>
              <name>REG_I3C_MST_VER_ID</name>
              <description>This field indicates the controller current release number that is read by an application.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VER_TYPE</name>
          <description>NA</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REG_I3C_MST_VER_TYPE</name>
              <description>This field indicates the controller current release type that is read by an application.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FPGA_DEBUG_PROBE</name>
          <description>NA</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>REG_I3C_MST_FPGA_DEBUG_PROBE</name>
              <description>For Debug Probe Test on FPGA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RND_ECO_CS</name>
          <description>NA</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REG_RND_ECO_EN</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RND_ECO_RESULT</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RND_ECO_LOW</name>
          <description>NA</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REG_RND_ECO_LOW</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RND_ECO_HIGH</name>
          <description>NA</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000FFFF</resetValue>
          <fields>
            <field>
              <name>REG_RND_ECO_HIGH</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
