seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>I3C_MST_MEM</name>
      <description>I3C_MST_MEM Peripheral</description>
      <groupName>I3C_MST_MEM</groupName>
      <baseAddress>0x500DA000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x108</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>COMMAND_BUF_PORT</name>
          <description>NA</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REG_COMMAND</name>
              <description>Contains a Command Descriptor structure that depends on the requested transfer type. Command Descriptor structure is used to schedule the transfers to devices on I3C bus.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESPONSE_BUF_PORT</name>
          <description>NA</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RESPONSE</name>
              <description>The Response Buffer can be read through this register. The response status for each Command is written into the Response Buffer by the controller if ROC (Response On Completion) bit is set or if transfer error has occurred. The response buffer can be read through this register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_DATA_PORT</name>
          <description>NA</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_DATA_PORT</name>
              <description>Receive Data Port. Receive data is mapped to the Rx-data buffer and receive data is always packed in 4-byte aligned data words.  If the length of data transfer is not aligned to 4-bytes boundary, then there will be extra(unused) bytes(the additional data bytes have to be ignored) at the end of the transferred data. The valid data must be identified using the DATA_LENGTH filed in the Response Descriptor.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_DATA_PORT</name>
          <description>NA</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REG_TX_DATA_PORT</name>
              <description>Transmit Data Port. Transmit data is mapped to the Tx-data  buffer and transmit data is always packed in 4-byte aligned data words.  If the length of data transfer is not aligned to 4-bytes boundary, then there will be extra(unused) bytes(the additional data bytes have to be ignored) at the end of the transferred data. The valid data must be identified using the DATA_LENGTH filed in the Response Descriptor.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IBI_STATUS_BUF</name>
          <description>In-Band Interrupt Buffer Status/Data Register. When receiving an IBI, IBI_PORT is used to both: Read the IBI Status Read the IBI Data(which is raw/opaque data)</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA_LENGTH</name>
              <description>This field represents the length of data received along with IBI, in bytes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IBI_ID</name>
              <description>IBI Identifier. The byte received after START which includes the address the R/W bit: Device  address and R/W bit in case of Slave Interrupt or Master Request.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IBI_STS</name>
              <description>IBI received data/status. IBI Data register is mapped to the IBI Buffer. The IBI Data is always packed in4-byte aligned and put to the IBI Buffer. This register When read from, reads the data from the IBI buffer. IBI Status register when read from, returns the data from the IBI Buffer and indicates how the controller responded to incoming IBI(SIR, MR and HJ).</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IBI_DATA_BUF</name>
          <description>NA</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IBI_DATA</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEV_ADDR_TABLE1_LOC</name>
          <description>NA</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REG_DAT_DEV1_STATIC_ADDR</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV1_DYNAMIC_ADDR</name>
              <description>Device Dynamic Address with parity, The MSB,bit[23], should be programmed with parity of dynamic address.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV1_NACK_RETRY_CNT</name>
              <description>This field is used to set the Device NACK Retry count for the particular device. If the Device NACK's for the device address, the controller automatically retries the same device until this count expires. If the Slave does not ACK for the mentioned number of retries, then controller generates an error response and move to the Halt state.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV1_I2C</name>
              <description>Legacy I2C device or not. This bit should be set to 1 if the device is a legacy I2C device.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEV_ADDR_TABLE2_LOC</name>
          <description>NA</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REG_DAT_DEV2_STATIC_ADDR</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV2_DYNAMIC_ADDR</name>
              <description>Device Dynamic Address with parity, The MSB,bit[23], should be programmed with parity of dynamic address.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV2_NACK_RETRY_CNT</name>
              <description>This field is used to set the Device NACK Retry count for the particular device. If the Device NACK's for the device address, the controller automatically retries the same device until this count expires. If the Slave does not ACK for the mentioned number of retries, then controller generates an error response and move to the Halt state.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV2_I2C</name>
              <description>Legacy I2C device or not. This bit should be set to 1 if the device is a legacy I2C device.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEV_ADDR_TABLE3_LOC</name>
          <description>NA</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REG_DAT_DEV3_STATIC_ADDR</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV3_DYNAMIC_ADDR</name>
              <description>Device Dynamic Address with parity, The MSB,bit[23], should be programmed with parity of dynamic address.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV3_NACK_RETRY_CNT</name>
              <description>This field is used to set the Device NACK Retry count for the particular device. If the Device NACK's for the device address, the controller automatically retries the same device until this count expires. If the Slave does not ACK for the mentioned number of retries, then controller generates an error response and move to the Halt state.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV3_I2C</name>
              <description>Legacy I2C device or not. This bit should be set to 1 if the device is a legacy I2C device.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEV_ADDR_TABLE4_LOC</name>
          <description>NA</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REG_DAT_DEV4_STATIC_ADDR</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV4_DYNAMIC_ADDR</name>
              <description>Device Dynamic Address with parity, The MSB,bit[23], should be programmed with parity of dynamic address.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV4_NACK_RETRY_CNT</name>
              <description>This field is used to set the Device NACK Retry count for the particular device. If the Device NACK's for the device address, the controller automatically retries the same device until this count expires. If the Slave does not ACK for the mentioned number of retries, then controller generates an error response and move to the Halt state.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV4_I2C</name>
              <description>Legacy I2C device or not. This bit should be set to 1 if the device is a legacy I2C device.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEV_ADDR_TABLE5_LOC</name>
          <description>NA</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REG_DAT_DEV5_STATIC_ADDR</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV5_DYNAMIC_ADDR</name>
              <description>Device Dynamic Address with parity, The MSB,bit[23], should be programmed with parity of dynamic address.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV5_NACK_RETRY_CNT</name>
              <description>This field is used to set the Device NACK Retry count for the particular device. If the Device NACK's for the device address, the controller automatically retries the same device until this count expires. If the Slave does not ACK for the mentioned number of retries, then controller generates an error response and move to the Halt state.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV5_I2C</name>
              <description>Legacy I2C device or not. This bit should be set to 1 if the device is a legacy I2C device.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEV_ADDR_TABLE6_LOC</name>
          <description>NA</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REG_DAT_DEV6_STATIC_ADDR</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV6_DYNAMIC_ADDR</name>
              <description>Device Dynamic Address with parity, The MSB,bit[23], should be programmed with parity of dynamic address.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV6_NACK_RETRY_CNT</name>
              <description>This field is used to set the Device NACK Retry count for the particular device. If the Device NACK's for the device address, the controller automatically retries the same device until this count expires. If the Slave does not ACK for the mentioned number of retries, then controller generates an error response and move to the Halt state.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV6_I2C</name>
              <description>Legacy I2C device or not. This bit should be set to 1 if the device is a legacy I2C device.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEV_ADDR_TABLE7_LOC</name>
          <description>NA</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REG_DAT_DEV7_STATIC_ADDR</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV7_DYNAMIC_ADDR</name>
              <description>Device Dynamic Address with parity, The MSB,bit[23], should be programmed with parity of dynamic address.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV7_NACK_RETRY_CNT</name>
              <description>This field is used to set the Device NACK Retry count for the particular device. If the Device NACK's for the device address, the controller automatically retries the same device until this count expires. If the Slave does not ACK for the mentioned number of retries, then controller generates an error response and move to the Halt state.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV7_I2C</name>
              <description>Legacy I2C device or not. This bit should be set to 1 if the device is a legacy I2C device.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEV_ADDR_TABLE8_LOC</name>
          <description>NA</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REG_DAT_DEV8_STATIC_ADDR</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV8_DYNAMIC_ADDR</name>
              <description>Device Dynamic Address with parity, The MSB,bit[23], should be programmed with parity of dynamic address.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV8_NACK_RETRY_CNT</name>
              <description>This field is used to set the Device NACK Retry count for the particular device. If the Device NACK's for the device address, the controller automatically retries the same device until this count expires. If the Slave does not ACK for the mentioned number of retries, then controller generates an error response and move to the Halt state.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV8_I2C</name>
              <description>Legacy I2C device or not. This bit should be set to 1 if the device is a legacy I2C device.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEV_ADDR_TABLE9_LOC</name>
          <description>NA</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REG_DAT_DEV9_STATIC_ADDR</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV9_DYNAMIC_ADDR</name>
              <description>Device Dynamic Address with parity, The MSB,bit[23], should be programmed with parity of dynamic address.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV9_NACK_RETRY_CNT</name>
              <description>This field is used to set the Device NACK Retry count for the particular device. If the Device NACK's for the device address, the controller automatically retries the same device until this count expires. If the Slave does not ACK for the mentioned number of retries, then controller generates an error response and move to the Halt state.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV9_I2C</name>
              <description>Legacy I2C device or not. This bit should be set to 1 if the device is a legacy I2C device.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEV_ADDR_TABLE10_LOC</name>
          <description>NA</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REG_DAT_DEV10_STATIC_ADDR</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV10_DYNAMIC_ADDR</name>
              <description>Device Dynamic Address with parity, The MSB,bit[23], should be programmed with parity of dynamic address.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV10_NACK_RETRY_CNT</name>
              <description>This field is used to set the Device NACK Retry count for the particular device. If the Device NACK's for the device address, the controller automatically retries the same device until this count expires. If the Slave does not ACK for the mentioned number of retries, then controller generates an error response and move to the Halt state.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DAT_DEV10_I2C</name>
              <description>Legacy I2C device or not. This bit should be set to 1 if the device is a legacy I2C device.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
