seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
        <register>
          <name>INT_ENA</name>
          <description>interrupt enable register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <resetValue>0x000000C3</resetValue>
          <fields>
            <field>
              <name>ISP_DATA_TYPE_ERR_INT_ENA</name>
              <description>write 1 to enable input data type error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISP_ASYNC_FIFO_OVF_INT_ENA</name>
              <description>write 1 to enable isp input fifo overflow</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISP_BUF_FULL_INT_ENA</name>
              <description>write 1 to enable isp input buffer full</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISP_HVNUM_SETTING_ERR_INT_ENA</name>
              <description>write 1 to enable hnum and vnum setting format error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISP_DATA_TYPE_SETTING_ERR_INT_ENA</name>
              <description>write 1 to enable setting invalid reg_data_type</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISP_MIPI_HNUM_UNMATCH_INT_ENA</name>
              <description>write 1 to enable hnum setting unmatch with mipi input</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPC_CHECK_DONE_INT_ENA</name>
              <description>write 1 to enable dpc check done</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_XCOORD_ERR_INT_ENA</name>
              <description>write 1 to enable gamma setting error</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE_MONITOR_INT_ENA</name>
              <description>write 1 to enable ae monitor</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE_FRAME_DONE_INT_ENA</name>
              <description>write 1 to enable ae</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AF_FDONE_INT_ENA</name>
              <description>write 1 to enable af statistic</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AF_ENV_INT_ENA</name>
              <description>write 1 to enable af monitor</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWB_FDONE_INT_ENA</name>
              <description>write 1 to enable awb</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_FDONE_INT_ENA</name>
              <description>write 1 to enable histogram</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAME_INT_ENA</name>
              <description>write 1 to enable isp frame end</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLC_FRAME_INT_ENA</name>
              <description>write 1 to enable blc frame done</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSC_FRAME_INT_ENA</name>
              <description>write 1 to enable lsc frame done</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPC_FRAME_INT_ENA</name>
              <description>write 1 to enable dpc frame done</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BF_FRAME_INT_ENA</name>
              <description>write 1 to enable bf frame done</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEMOSAIC_FRAME_INT_ENA</name>
              <description>write 1 to enable demosaic frame done</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEDIAN_FRAME_INT_ENA</name>
              <description>write 1 to enable median frame done</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCM_FRAME_INT_ENA</name>
              <description>write 1 to enable ccm frame done</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_FRAME_INT_ENA</name>
              <description>write 1 to enable gamma frame done</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RGB2YUV_FRAME_INT_ENA</name>
              <description>write 1 to enable rgb2yuv frame done</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHARP_FRAME_INT_ENA</name>
              <description>write 1 to enable sharp frame done</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLOR_FRAME_INT_ENA</name>
              <description>write 1 to enable color frame done</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YUV2RGB_FRAME_INT_ENA</name>
              <description>write 1 to enable yuv2rgb frame done</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TAIL_IDI_FRAME_INT_ENA</name>
              <description>write 1 to enable isp_tail idi frame_end</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HEADER_IDI_FRAME_INT_ENA</name>
              <description>write 1 to enable real input frame end of isp_input</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>interrupt clear register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ISP_DATA_TYPE_ERR_INT_CLR</name>
              <description>write 1 to clear input data type error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ISP_ASYNC_FIFO_OVF_INT_CLR</name>
              <description>write 1 to clear isp input fifo overflow</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ISP_BUF_FULL_INT_CLR</name>
              <description>write 1 to clear isp input buffer full</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ISP_HVNUM_SETTING_ERR_INT_CLR</name>
              <description>write 1 to clear hnum and vnum setting format error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ISP_DATA_TYPE_SETTING_ERR_INT_CLR</name>
              <description>write 1 to clear setting invalid reg_data_type</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ISP_MIPI_HNUM_UNMATCH_INT_CLR</name>
              <description>write 1 to clear hnum setting unmatch with mipi input</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DPC_CHECK_DONE_INT_CLR</name>
              <description>write 1 to clear dpc check done</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GAMMA_XCOORD_ERR_INT_CLR</name>
              <description>write 1 to clear gamma setting error</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AE_MONITOR_INT_CLR</name>
              <description>write 1 to clear ae monitor</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AE_FRAME_DONE_INT_CLR</name>
              <description>write 1 to clear ae</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AF_FDONE_INT_CLR</name>
              <description>write 1 to clear af statistic</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AF_ENV_INT_CLR</name>
              <description>write 1 to clear af monitor</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AWB_FDONE_INT_CLR</name>
              <description>write 1 to clear awb</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HIST_FDONE_INT_CLR</name>
              <description>write 1 to clear histogram</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FRAME_INT_CLR</name>
              <description>write 1 to clear isp frame end</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BLC_FRAME_INT_CLR</name>
              <description>write 1 to clear blc frame done</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LSC_FRAME_INT_CLR</name>
              <description>write 1 to clear lsc frame done</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DPC_FRAME_INT_CLR</name>
              <description>write 1 to clear dpc frame done</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BF_FRAME_INT_CLR</name>
              <description>write 1 to clear bf frame done</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DEMOSAIC_FRAME_INT_CLR</name>
              <description>write 1 to clear demosaic frame done</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MEDIAN_FRAME_INT_CLR</name>
              <description>write 1 to clear median frame done</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CCM_FRAME_INT_CLR</name>
              <description>write 1 to clear ccm frame done</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GAMMA_FRAME_INT_CLR</name>
              <description>write 1 to clear gamma frame done</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RGB2YUV_FRAME_INT_CLR</name>
              <description>write 1 to clear rgb2yuv frame done</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SHARP_FRAME_INT_CLR</name>
              <description>write 1 to clear sharp frame done</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COLOR_FRAME_INT_CLR</name>
              <description>write 1 to clear color frame done</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>YUV2RGB_FRAME_INT_CLR</name>
              <description>write 1 to clear yuv2rgb frame done</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TAIL_IDI_FRAME_INT_CLR</name>
              <description>write 1 to clear isp_tail idi frame_end</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HEADER_IDI_FRAME_INT_CLR</name>
              <description>write 1 to clear real input frame end of isp_input</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAMMA_CTRL</name>
          <description>gamma control register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000000E</resetValue>
          <fields>
            <field>
              <name>GAMMA_UPDATE</name>
              <description>Indicates that gamma register configuration is complete</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_LAST_CORRECT</name>
              <description>this bit configures enable of last b segment correcction. 0: disable, 1: enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_LAST_CORRECT</name>
              <description>this bit configures enable of last g segment correcction. 0: disable, 1: enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_LAST_CORRECT</name>
              <description>this bit configures enable of last r segment correcction. 0: disable, 1: enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAMMA_RY1</name>
          <description>point of Y-axis of r channel gamma curve register 1</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <resetValue>0x10203040</resetValue>
          <fields>
            <field>
              <name>GAMMA_R_Y03</name>
              <description>this field configures the point 3 of Y-axis of r channel gamma curve</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_Y02</name>
              <description>this field configures the point 2 of Y-axis of r channel gamma curve</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_Y01</name>
              <description>this field configures the point 1 of Y-axis of r channel gamma curve</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_Y00</name>
              <description>this field configures the point 0 of Y-axis of r channel gamma curve</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAMMA_RY2</name>
          <description>point of Y-axis of r channel gamma curve register 2</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <resetValue>0x50607080</resetValue>
          <fields>
            <field>
              <name>GAMMA_R_Y07</name>
              <description>this field configures the point 7 of Y-axis of r channel gamma curve</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_Y06</name>
              <description>this field configures the point 6 of Y-axis of r channel gamma curve</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_Y05</name>
              <description>this field configures the point 5 of Y-axis of r channel gamma curve</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_Y04</name>
              <description>this field configures the point 4 of Y-axis of r channel gamma curve</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAMMA_RY3</name>
          <description>point of Y-axis of r channel gamma curve register 3</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <resetValue>0x90A0B0C0</resetValue>
          <fields>
            <field>
              <name>GAMMA_R_Y0B</name>
              <description>this field configures the point 11 of Y-axis of r channel gamma curve</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_Y0A</name>
              <description>this field configures the point 10 of Y-axis of r channel gamma curve</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_Y09</name>
              <description>this field configures the point 9 of Y-axis of r channel gamma curve</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_Y08</name>
              <description>this field configures the point 8 of Y-axis of r channel gamma curve</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
