seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
        <register>
          <name>GAMMA_RY4</name>
          <description>point of Y-axis of r channel gamma curve register 4</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <resetValue>0xD0E0F0FF</resetValue>
          <fields>
            <field>
              <name>GAMMA_R_Y0F</name>
              <description>this field configures the point 15 of Y-axis of r channel gamma curve</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_Y0E</name>
              <description>this field configures the point 14 of Y-axis of r channel gamma curve</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_Y0D</name>
              <description>this field configures the point 13 of Y-axis of r channel gamma curve</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_Y0C</name>
              <description>this field configures the point 12 of Y-axis of r channel gamma curve</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAMMA_GY1</name>
          <description>point of Y-axis of g channel gamma curve register 1</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <resetValue>0x10203040</resetValue>
          <fields>
            <field>
              <name>GAMMA_G_Y03</name>
              <description>this field configures the point 3 of Y-axis of g channel gamma curve</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_Y02</name>
              <description>this field configures the point 2 of Y-axis of g channel gamma curve</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_Y01</name>
              <description>this field configures the point 1 of Y-axis of g channel gamma curve</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_Y00</name>
              <description>this field configures the point 0 of Y-axis of g channel gamma curve</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAMMA_GY2</name>
          <description>point of Y-axis of g channel gamma curve register 2</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <resetValue>0x50607080</resetValue>
          <fields>
            <field>
              <name>GAMMA_G_Y07</name>
              <description>this field configures the point 7 of Y-axis of g channel gamma curve</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_Y06</name>
              <description>this field configures the point 6 of Y-axis of g channel gamma curve</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_Y05</name>
              <description>this field configures the point 5 of Y-axis of g channel gamma curve</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_Y04</name>
              <description>this field configures the point 4 of Y-axis of g channel gamma curve</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAMMA_GY3</name>
          <description>point of Y-axis of g channel gamma curve register 3</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <resetValue>0x90A0B0C0</resetValue>
          <fields>
            <field>
              <name>GAMMA_G_Y0B</name>
              <description>this field configures the point 11 of Y-axis of g channel gamma curve</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_Y0A</name>
              <description>this field configures the point 10 of Y-axis of g channel gamma curve</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_Y09</name>
              <description>this field configures the point 9 of Y-axis of g channel gamma curve</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_Y08</name>
              <description>this field configures the point 8 of Y-axis of g channel gamma curve</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAMMA_GY4</name>
          <description>point of Y-axis of g channel gamma curve register 4</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <resetValue>0xD0E0F0FF</resetValue>
          <fields>
            <field>
              <name>GAMMA_G_Y0F</name>
              <description>this field configures the point 15 of Y-axis of g channel gamma curve</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_Y0E</name>
              <description>this field configures the point 14 of Y-axis of g channel gamma curve</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_Y0D</name>
              <description>this field configures the point 13 of Y-axis of g channel gamma curve</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_Y0C</name>
              <description>this field configures the point 12 of Y-axis of g channel gamma curve</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAMMA_BY1</name>
          <description>point of Y-axis of b channel gamma curve register 1</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <resetValue>0x10203040</resetValue>
          <fields>
            <field>
              <name>GAMMA_B_Y03</name>
              <description>this field configures the point 3 of Y-axis of b channel gamma curve</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_Y02</name>
              <description>this field configures the point 2 of Y-axis of b channel gamma curve</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_Y01</name>
              <description>this field configures the point 1 of Y-axis of b channel gamma curve</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_Y00</name>
              <description>this field configures the point 0 of Y-axis of b channel gamma curve</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAMMA_BY2</name>
          <description>point of Y-axis of b channel gamma curve register 2</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <resetValue>0x50607080</resetValue>
          <fields>
            <field>
              <name>GAMMA_B_Y07</name>
              <description>this field configures the point 7 of Y-axis of b channel gamma curve</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_Y06</name>
              <description>this field configures the point 6 of Y-axis of b channel gamma curve</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_Y05</name>
              <description>this field configures the point 5 of Y-axis of b channel gamma curve</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_Y04</name>
              <description>this field configures the point 4 of Y-axis of b channel gamma curve</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAMMA_BY3</name>
          <description>point of Y-axis of b channel gamma curve register 3</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <resetValue>0x90A0B0C0</resetValue>
          <fields>
            <field>
              <name>GAMMA_B_Y0B</name>
              <description>this field configures the point 11 of Y-axis of b channel gamma curve</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_Y0A</name>
              <description>this field configures the point 10 of Y-axis of b channel gamma curve</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_Y09</name>
              <description>this field configures the point 9 of Y-axis of b channel gamma curve</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_Y08</name>
              <description>this field configures the point 8 of Y-axis of b channel gamma curve</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAMMA_BY4</name>
          <description>point of Y-axis of b channel gamma curve register 4</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <resetValue>0xD0E0F0FF</resetValue>
          <fields>
            <field>
              <name>GAMMA_B_Y0F</name>
              <description>this field configures the point 15 of Y-axis of b channel gamma curve</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_Y0E</name>
              <description>this field configures the point 14 of Y-axis of b channel gamma curve</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_Y0D</name>
              <description>this field configures the point 13 of Y-axis of b channel gamma curve</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_Y0C</name>
              <description>this field configures the point 12 of Y-axis of b channel gamma curve</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAMMA_RX1</name>
          <description>point of X-axis of r channel gamma curve register 1</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00924924</resetValue>
          <fields>
            <field>
              <name>GAMMA_R_X07</name>
              <description>this field configures the point 7 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_X06</name>
              <description>this field configures the point 6 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_X05</name>
              <description>this field configures the point 5 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_X04</name>
              <description>this field configures the point 4 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_X03</name>
              <description>this field configures the point 3 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_X02</name>
              <description>this field configures the point 2 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_X01</name>
              <description>this field configures the point 1 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_X00</name>
              <description>this field configures the point 0 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAMMA_RX2</name>
          <description>point of X-axis of r channel gamma curve register 2</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00924924</resetValue>
          <fields>
            <field>
              <name>GAMMA_R_X0F</name>
              <description>this field configures the point 15 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_X0E</name>
              <description>this field configures the point 14 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_X0D</name>
              <description>this field configures the point 13 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_X0C</name>
              <description>this field configures the point 12 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_X0B</name>
              <description>this field configures the point 11 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_X0A</name>
              <description>this field configures the point 10 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_X09</name>
              <description>this field configures the point 9 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_R_X08</name>
              <description>this field configures the point 8 of X-axis of r channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAMMA_GX1</name>
          <description>point of X-axis of g channel gamma curve register 1</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00924924</resetValue>
          <fields>
            <field>
              <name>GAMMA_G_X07</name>
              <description>this field configures the point 7 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_X06</name>
              <description>this field configures the point 6 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_X05</name>
              <description>this field configures the point 5 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_X04</name>
              <description>this field configures the point 4 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_X03</name>
              <description>this field configures the point 3 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_X02</name>
              <description>this field configures the point 2 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_X01</name>
              <description>this field configures the point 1 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_X00</name>
              <description>this field configures the point 0 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
