seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
        <register>
          <name>HIST_COEFF</name>
          <description>histogram rgb to gray coefficients register</description>
          <addressOffset>0x1A8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00555555</resetValue>
          <fields>
            <field>
              <name>B</name>
              <description>this field configures coefficient of B when set hist_mode to RGB, sum of coeff_r and coeff_g and coeff_b should be 256</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>G</name>
              <description>this field configures coefficient of G when set hist_mode to RGB, sum of coeff_r and coeff_g and coeff_b should be 256</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>R</name>
              <description>this field configures coefficient of R when set hist_mode to RGB, sum of coeff_r and coeff_g and coeff_b should be 256</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_OFFS</name>
          <description>histogram window offsets register</description>
          <addressOffset>0x1AC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HIST_Y_OFFS</name>
              <description>this field configures y coordinate of first window</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_X_OFFS</name>
              <description>this field configures x coordinate of first window</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_SIZE</name>
          <description>histogram sub-window size register</description>
          <addressOffset>0x1B0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00120020</resetValue>
          <fields>
            <field>
              <name>HIST_Y_SIZE</name>
              <description>this field configures y direction size of subwindow</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_X_SIZE</name>
              <description>this field configures x direction size of subwindow</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_SEG0</name>
          <description>histogram bin control register 0</description>
          <addressOffset>0x1B4</addressOffset>
          <size>0x20</size>
          <resetValue>0x10203040</resetValue>
          <fields>
            <field>
              <name>HIST_SEG_3_4</name>
              <description>this field configures threshold of histogram bin 3 and bin 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_SEG_2_3</name>
              <description>this field configures threshold of histogram bin 2 and bin 3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_SEG_1_2</name>
              <description>this field configures threshold of histogram bin 1 and bin 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_SEG_0_1</name>
              <description>this field configures threshold of histogram bin 0 and bin 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_SEG1</name>
          <description>histogram bin control register 1</description>
          <addressOffset>0x1B8</addressOffset>
          <size>0x20</size>
          <resetValue>0x50607080</resetValue>
          <fields>
            <field>
              <name>HIST_SEG_7_8</name>
              <description>this field configures threshold of histogram bin 7 and bin 8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_SEG_6_7</name>
              <description>this field configures threshold of histogram bin 6 and bin 7</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_SEG_5_6</name>
              <description>this field configures threshold of histogram bin 5 and bin 6</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_SEG_4_5</name>
              <description>this field configures threshold of histogram bin 4 and bin 5</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_SEG2</name>
          <description>histogram bin control register 2</description>
          <addressOffset>0x1BC</addressOffset>
          <size>0x20</size>
          <resetValue>0x90A0B0C0</resetValue>
          <fields>
            <field>
              <name>HIST_SEG_11_12</name>
              <description>this field configures threshold of histogram bin 11 and bin 12</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_SEG_10_11</name>
              <description>this field configures threshold of histogram bin 10 and bin 11</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_SEG_9_10</name>
              <description>this field configures threshold of histogram bin 9 and bin 10</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_SEG_8_9</name>
              <description>this field configures threshold of histogram bin 8 and bin 9</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_SEG3</name>
          <description>histogram bin control register 3</description>
          <addressOffset>0x1C0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00D0E0F0</resetValue>
          <fields>
            <field>
              <name>HIST_SEG_14_15</name>
              <description>this field configures threshold of histogram bin 14 and bin 15</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_SEG_13_14</name>
              <description>this field configures threshold of histogram bin 13 and bin 14</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_SEG_12_13</name>
              <description>this field configures threshold of histogram bin 12 and bin 13</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_WEIGHT0</name>
          <description>histogram sub-window weight register 0</description>
          <addressOffset>0x1C4</addressOffset>
          <size>0x20</size>
          <resetValue>0x01010101</resetValue>
          <fields>
            <field>
              <name>HIST_WEIGHT_03</name>
              <description>this field configures weight of subwindow 03</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_WEIGHT_02</name>
              <description>this field configures weight of subwindow 02</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_WEIGHT_01</name>
              <description>this field configures weight of subwindow 01</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_WEIGHT_00</name>
              <description>this field configures weight of subwindow 00 and sum of all weight should be 256</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_WEIGHT1</name>
          <description>histogram sub-window weight register 1</description>
          <addressOffset>0x1C8</addressOffset>
          <size>0x20</size>
          <resetValue>0x01010101</resetValue>
          <fields>
            <field>
              <name>HIST_WEIGHT_12</name>
              <description>this field configures weight of subwindow 12</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_WEIGHT_11</name>
              <description>this field configures weight of subwindow 11</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_WEIGHT_10</name>
              <description>this field configures weight of subwindow 10</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_WEIGHT_04</name>
              <description>this field configures weight of subwindow 04</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_WEIGHT2</name>
          <description>histogram sub-window weight register 2</description>
          <addressOffset>0x1CC</addressOffset>
          <size>0x20</size>
          <resetValue>0x01010101</resetValue>
          <fields>
            <field>
              <name>HIST_WEIGHT_21</name>
              <description>this field configures weight of subwindow 21</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_WEIGHT_20</name>
              <description>this field configures weight of subwindow 20</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_WEIGHT_14</name>
              <description>this field configures weight of subwindow 04</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_WEIGHT_13</name>
              <description>this field configures weight of subwindow 13</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_WEIGHT3</name>
          <description>histogram sub-window weight register 3</description>
          <addressOffset>0x1D0</addressOffset>
          <size>0x20</size>
          <resetValue>0xE8010101</resetValue>
          <fields>
            <field>
              <name>HIST_WEIGHT_30</name>
              <description>this field configures weight of subwindow 30</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_WEIGHT_24</name>
              <description>this field configures weight of subwindow 24</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_WEIGHT_23</name>
              <description>this field configures weight of subwindow 23</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_WEIGHT_22</name>
              <description>this field configures weight of subwindow 22</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_WEIGHT4</name>
          <description>histogram sub-window weight register 4</description>
          <addressOffset>0x1D4</addressOffset>
          <size>0x20</size>
          <resetValue>0x01010101</resetValue>
          <fields>
            <field>
              <name>HIST_WEIGHT_34</name>
              <description>this field configures weight of subwindow 34</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_WEIGHT_33</name>
              <description>this field configures weight of subwindow 33</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_WEIGHT_32</name>
              <description>this field configures weight of subwindow 32</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_WEIGHT_31</name>
              <description>this field configures weight of subwindow 31</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_WEIGHT5</name>
          <description>histogram sub-window weight register 5</description>
          <addressOffset>0x1D8</addressOffset>
          <size>0x20</size>
          <resetValue>0x01010101</resetValue>
          <fields>
            <field>
              <name>HIST_WEIGHT_43</name>
              <description>this field configures weight of subwindow 43</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_WEIGHT_42</name>
              <description>this field configures weight of subwindow 42</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_WEIGHT_41</name>
              <description>this field configures weight of subwindow 41</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_WEIGHT_40</name>
              <description>this field configures weight of subwindow 40</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_WEIGHT6</name>
          <description>histogram sub-window weight register 6</description>
          <addressOffset>0x1DC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>HIST_WEIGHT_44</name>
              <description>this field configures weight of subwindow 44</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_BIN0</name>
          <description>result of histogram bin 0</description>
          <addressOffset>0x1E0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HIST_BIN_0</name>
              <description>this field represents result of histogram bin 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_BIN1</name>
          <description>result of histogram bin 1</description>
          <addressOffset>0x1E4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HIST_BIN_1</name>
              <description>this field represents result of histogram bin 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_BIN2</name>
          <description>result of histogram bin 2</description>
          <addressOffset>0x1E8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HIST_BIN_2</name>
              <description>this field represents result of histogram bin 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_BIN3</name>
          <description>result of histogram bin 3</description>
          <addressOffset>0x1EC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HIST_BIN_3</name>
              <description>this field represents result of histogram bin 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_BIN4</name>
          <description>result of histogram bin 4</description>
          <addressOffset>0x1F0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HIST_BIN_4</name>
              <description>this field represents result of histogram bin 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_BIN5</name>
          <description>result of histogram bin 5</description>
          <addressOffset>0x1F4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HIST_BIN_5</name>
              <description>this field represents result of histogram bin 5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_BIN6</name>
          <description>result of histogram bin 6</description>
          <addressOffset>0x1F8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HIST_BIN_6</name>
              <description>this field represents result of histogram bin 6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_BIN7</name>
          <description>result of histogram bin 7</description>
          <addressOffset>0x1FC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HIST_BIN_7</name>
              <description>this field represents result of histogram bin 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_BIN8</name>
          <description>result of histogram bin 8</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HIST_BIN_8</name>
              <description>this field represents result of histogram bin 8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_BIN9</name>
          <description>result of histogram bin 9</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HIST_BIN_9</name>
              <description>this field represents result of histogram bin 9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
