seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
        <register>
          <name>HIST_BIN10</name>
          <description>result of histogram bin 10</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HIST_BIN_10</name>
              <description>this field represents result of histogram bin 10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_BIN11</name>
          <description>result of histogram bin 11</description>
          <addressOffset>0x20C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HIST_BIN_11</name>
              <description>this field represents result of histogram bin 11</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_BIN12</name>
          <description>result of histogram bin 12</description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HIST_BIN_12</name>
              <description>this field represents result of histogram bin 12</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_BIN13</name>
          <description>result of histogram bin 13</description>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HIST_BIN_13</name>
              <description>this field represents result of histogram bin 13</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_BIN14</name>
          <description>result of histogram bin 14</description>
          <addressOffset>0x218</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HIST_BIN_14</name>
              <description>this field represents result of histogram bin 14</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_BIN15</name>
          <description>result of histogram bin 15</description>
          <addressOffset>0x21C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HIST_BIN_15</name>
              <description>this field represents result of histogram bin 15</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_AUX_CTRL_0</name>
          <description>mem aux control register 0</description>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <resetValue>0x13201320</resetValue>
          <fields>
            <field>
              <name>HEADER_MEM_AUX_CTRL</name>
              <description>this field configures the mem_aux of isp input buffer memory</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPC_LUT_MEM_AUX_CTRL</name>
              <description>this field represents this field configures the mem_aux of dpc lut memory</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_AUX_CTRL_1</name>
          <description>mem aux control register 1</description>
          <addressOffset>0x224</addressOffset>
          <size>0x20</size>
          <resetValue>0x13201320</resetValue>
          <fields>
            <field>
              <name>LSC_LUT_R_GR_MEM_AUX_CTRL</name>
              <description>this field configures the mem_aux of lsc r gr lut memory</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSC_LUT_GB_B_MEM_AUX_CTRL</name>
              <description>this field configures the mem_aux of lsc gb b lut memory</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_AUX_CTRL_2</name>
          <description>mem aux control register 2</description>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
          <resetValue>0x13201320</resetValue>
          <fields>
            <field>
              <name>BF_MATRIX_MEM_AUX_CTRL</name>
              <description>this field configures the mem_aux of bf line buffer memory</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPC_MATRIX_MEM_AUX_CTRL</name>
              <description>this field configures the mem_aux of dpc line buffer memory</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_AUX_CTRL_3</name>
          <description>mem aux control register 3</description>
          <addressOffset>0x22C</addressOffset>
          <size>0x20</size>
          <resetValue>0x13201320</resetValue>
          <fields>
            <field>
              <name>SHARP_MATRIX_Y_MEM_AUX_CTRL</name>
              <description>this field configures the mem_aux of sharp y line buffer memory</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEMOSAIC_MATRIX_MEM_AUX_CTRL</name>
              <description>this field configures the mem_aux of demosaic line buffer memory</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_AUX_CTRL_4</name>
          <description>mem aux control register 4</description>
          <addressOffset>0x230</addressOffset>
          <size>0x20</size>
          <resetValue>0x00001320</resetValue>
          <fields>
            <field>
              <name>SHARP_MATRIX_UV_MEM_AUX_CTRL</name>
              <description>this field configures the mem_aux of sharp uv line buffer memory</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>YUV_FORMAT</name>
          <description>yuv format control register</description>
          <addressOffset>0x234</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>YUV_MODE</name>
              <description>this bit configures the yuv mode. 0: ITU-R BT.601, 1: ITU-R BT.709</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YUV_RANGE</name>
              <description>this bit configures the yuv range. 0: full range, 1: limit range</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDN_ECO_CS</name>
          <description>rdn eco cs register</description>
          <addressOffset>0x238</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RDN_ECO_EN</name>
              <description>rdn_eco_en</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDN_ECO_RESULT</name>
              <description>rdn_eco_result</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDN_ECO_LOW</name>
          <description>rdn eco all low register</description>
          <addressOffset>0x23C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RDN_ECO_LOW</name>
              <description>rdn_eco_low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDN_ECO_HIGH</name>
          <description>rdn eco all high register</description>
          <addressOffset>0x240</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>RDN_ECO_HIGH</name>
              <description>rdn_eco_high</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
