seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>JPEG</name>
      <description>JPEG Codec</description>
      <groupName>JPEG</groupName>
      <baseAddress>0x50086000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xB0</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>JPEG</name>
        <value>95</value>
      </interrupt>
      <registers>
        <register>
          <name>CONFIG</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00408958</resetValue>
          <fields>
            <field>
              <name>FSM_RST</name>
              <description>fsm reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>JPEG_START</name>
              <description>start to compress a new pic(in dma reg mode)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>QNR_PRESITION</name>
              <description>0:8bit qnr,1:12bit qnr(TBD)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FF_CHECK_EN</name>
              <description>enable whether to add "00" after "ff"</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPLE_SEL</name>
              <description>0:yuv444,1:yuv422, 2:yuv420</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_LINKLIST_MODE</name>
              <description>1:use linklist to configure dma</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEBUG_DIRECT_OUT_EN</name>
              <description>0:normal mode,1:debug mode for direct output from input</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRAY_SEL</name>
              <description>0:use non-fifo way to access qnr ram,1:use fifo way to access qnr ram</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LQNR_TBL_SEL</name>
              <description>choose  luminance quntization table id(TBD)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CQNR_TBL_SEL</name>
              <description>choose  chrominance quntization table id (TBD)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLOR_SPACE</name>
              <description>configure picture's color space:0-rb888,1-yuv422,2-rgb565, 3-gray</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DHT_FIFO_EN</name>
              <description>0:use non-fifo way to write dht len_total/codemin/value table,1:use fifo way to write dht len_total/codemin/value table. Reading dht len_total/codemin/value table only has nonfifo way</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_CLK_FORCE_ON</name>
              <description>force memory's clock enabled</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JFIF_VER</name>
              <description>decode pause period to trigger decode_timeout int, the timeout periods =2 power (reg_decode_timeout_thres) -1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DECODE_TIMEOUT_TASK_SEL</name>
              <description>0: software use reset to abort decode process ,1: decoder abort decode process by itself</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFT_RST</name>
              <description>when set to 1, soft reset JPEG module except jpeg_reg module</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFO_RST</name>
              <description>fifo reset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIXEL_REV</name>
              <description>reverse the source color pixel</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TAILER_EN</name>
              <description>set this bit to add EOI of "0xffd9" at the end of bitstream</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAUSE_EN</name>
              <description>set this bit to pause jpeg encoding</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_FORCE_PD</name>
              <description>0: no operation,1:force jpeg memory to power down</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_FORCE_PU</name>
              <description>0: no operation,1:force jpeg memory to power up</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>0:encoder mode, 1: decoder mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DQT_INFO</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x03020100</resetValue>
          <fields>
            <field>
              <name>T0_DQT_INFO</name>
              <description>Configure dqt table0's quantization coefficient precision in bit[7:4], configure dqt table0's table id in bit[3:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T1_DQT_INFO</name>
              <description>Configure dqt table1's quantization coefficient precision in bit[7:4], configure dqt table1's table id in bit[3:0]</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T2_DQT_INFO</name>
              <description>Configure dqt table2's quantization coefficient precision in bit[7:4], configure dqt table2's table id in bit[3:0]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T3_DQT_INFO</name>
              <description>Configure dqt table3's quantization coefficient precision in bit[7:4], configure dqt table3's table id in bit[3:0]</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIC_SIZE</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x028001E0</resetValue>
          <fields>
            <field>
              <name>VA</name>
              <description>configure picture's height. when encode, the max configurable bits is 14, when decode, the max configurable bits is 16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HA</name>
              <description>configure picture's width. when encode, the max configurable bits is 14, when decode, the max configurable bits is 16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T0QNR</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>T0_QNR_VAL</name>
              <description>write this reg to configure 64 quantization coefficient in t0 table</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T1QNR</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHROMINANCE_QNR_VAL</name>
              <description>write this reg to configure 64 quantization coefficient in t1 table</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T2QNR</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>T2_QNR_VAL</name>
              <description>write this reg to configure 64 quantization coefficient in t2 table</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T3QNR</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>T3_QNR_VAL</name>
              <description>write this reg to configure 64 quantization coefficient in t3 table</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DECODE_CONF</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x5F030000</resetValue>
          <fields>
            <field>
              <name>RESTART_INTERVAL</name>
              <description>configure restart interval in DRI marker when decode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPONENT_NUM</name>
              <description>configure number of components in frame when decode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_DHT_EN</name>
              <description>software decode dht table enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOS_CHECK_BYTE_NUM</name>
              <description>Configure the byte number to check next sos marker in the multi-scan picture after one scan is decoded down. The real check number is reg_sos_check_byte_num+1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RST_CHECK_BYTE_NUM</name>
              <description>Configure the byte number to check next rst marker after one rst interval is decoded down. The real check number is reg_rst_check_byte_num+1</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MULTI_SCAN_ERR_CHECK</name>
              <description>reserved for decoder</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEZIGZAG_READY_CTL</name>
              <description>reserved for decoder</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x00001100</resetValue>
          <fields>
            <field>
              <name>DQT_TBL_SEL</name>
              <description>choose  c0 quntization table id (TBD)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y_FACTOR</name>
              <description>vertical sampling factor of c0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X_FACTOR</name>
              <description>horizontal sampling factor of c0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ID</name>
              <description>the identifier of c0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C1</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x00001100</resetValue>
          <fields>
            <field>
              <name>DQT_TBL_SEL</name>
              <description>choose  c1 quntization table id (TBD)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y_FACTOR</name>
              <description>vertical sampling factor of c1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X_FACTOR</name>
              <description>horizontal sampling factor of c1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ID</name>
              <description>the identifier of c1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C2</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00001100</resetValue>
          <fields>
            <field>
              <name>DQT_TBL_SEL</name>
              <description>choose  c2 quntization table id (TBD)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y_FACTOR</name>
              <description>vertical sampling factor of c2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X_FACTOR</name>
              <description>horizontal sampling factor of c2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ID</name>
              <description>the identifier of c2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C3</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x00001100</resetValue>
          <fields>
            <field>
              <name>DQT_TBL_SEL</name>
              <description>choose  c3 quntization table id (TBD)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y_FACTOR</name>
              <description>vertical sampling factor of c3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X_FACTOR</name>
              <description>horizontal sampling factor of c3</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ID</name>
              <description>the identifier of c3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DHT_INFO</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00001010</resetValue>
          <fields>
            <field>
              <name>DC0_DHT_ID</name>
              <description>configure dht dc table 0 id</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DC1_DHT_ID</name>
              <description>configure dht dc table 1 id</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AC0_DHT_ID</name>
              <description>configure dht ac table 0 id</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AC1_DHT_ID</name>
              <description>configure dht ac table 1 id</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
