seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
        <register>
          <name>INT_ST</name>
          <description>Interrupt status registers</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DONE_INT_ST</name>
              <description>This status interrupt bit turns to high level when JPEG finishes encoding a picture..</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RLE_PARALLEL_ERR_INT_ST</name>
              <description>The status interrupt bit to sign that rle parallel error when decoding.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CID_ERR_INT_ST</name>
              <description>The status interrupt bit to sign that scan id check with component fails when decoding.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>C_DHT_DC_ID_ERR_INT_ST</name>
              <description>The status interrupt bit to sign that scan component's dc dht id check with dc dht table's id fails when decoding.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>C_DHT_AC_ID_ERR_INT_ST</name>
              <description>The status interrupt bit to sign that scan component's ac dht id check with ac dht table's id fails when decoding.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>C_DQT_ID_ERR_INT_ST</name>
              <description>The status interrupt bit to sign that scan component's dqt id check with dqt table's id fails when decoding.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RST_UXP_ERR_INT_ST</name>
              <description>The status interrupt bit to sign that RST header marker is detected but restart interval is 0 when decoding.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RST_CHECK_NONE_ERR_INT_ST</name>
              <description>The status interrupt bit to sign that RST header marker is not detected but restart interval is not 0 when decoding.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RST_CHECK_POS_ERR_INT_ST</name>
              <description>The status interrupt bit to sign that RST header marker position mismatches with restart interval when decoding.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_EOF_INT_ST</name>
              <description>The status interrupt bit turns to high level when the last pixel of one square has been transmitted for Tx channel.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SR_COLOR_MODE_ERR_INT_ST</name>
              <description>The status interrupt bit to sign that the selected source color mode is not supported.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DCT_DONE_INT_ST</name>
              <description>The status interrupt bit to sign that one dct calculation is finished.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BS_LAST_BLOCK_EOF_INT_ST</name>
              <description>The status interrupt bit to sign that the coding process for last block is finished.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SCAN_CHECK_NONE_ERR_INT_ST</name>
              <description>The status interrupt bit to sign that SOS header marker is not detected but there are still components left to be decoded.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SCAN_CHECK_POS_ERR_INT_ST</name>
              <description>The status interrupt bit to sign that SOS header marker position wrong when decoding.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UXP_DET_INT_ST</name>
              <description>The status interrupt bit to sign that unsupported header marker is detected when decoding.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EN_FRAME_EOF_ERR_INT_ST</name>
              <description>The status interrupt bit to sign that received pixel blocks are smaller than expected when encoding.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EN_FRAME_EOF_LACK_INT_ST</name>
              <description>The status interrupt bit to sign that the frame eof sign bit from dma input is missing when encoding. But the number of pixel blocks is enough.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DE_FRAME_EOF_ERR_INT_ST</name>
              <description>The status interrupt bit to sign that decoded blocks are smaller than expected when decoding.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DE_FRAME_EOF_LACK_INT_ST</name>
              <description>The status interrupt bit to sign that the either frame eof from dma input or eoi marker is missing when encoding. But the number of decoded blocks is enough.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOS_UNMATCH_ERR_INT_ST</name>
              <description>The status interrupt bit to sign that the component number of a scan is 0 or does not match the sos marker's length when decoding.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MARKER_ERR_FST_SCAN_INT_ST</name>
              <description>The status interrupt bit to sign that the first scan has header marker error when decoding.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MARKER_ERR_OTHER_SCAN_INT_ST</name>
              <description>The status interrupt bit to sign that the following scans but not the first scan have header marker error when decoding.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UNDET_INT_ST</name>
              <description>The status interrupt bit to sign that JPEG format is not detected at the eof data of a packet when decoding.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DECODE_TIMEOUT_INT_ST</name>
              <description>The status interrupt bit to sign that decode pause time is longer than the setting decode timeout time when decoding.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>Interrupt clear registers</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DONE_INT_CLR</name>
              <description>This clear interrupt bit turns to high level when JPEG finishes encoding a picture..</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RLE_PARALLEL_ERR_INT_CLR</name>
              <description>The clear interrupt bit to sign that rle parallel error when decoding.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CID_ERR_INT_CLR</name>
              <description>The clear interrupt bit to sign that scan id check with component fails when decoding.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>C_DHT_DC_ID_ERR_INT_CLR</name>
              <description>The clear interrupt bit to sign that scan component's dc dht id check with dc dht table's id fails when decoding.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>C_DHT_AC_ID_ERR_INT_CLR</name>
              <description>The clear interrupt bit to sign that scan component's ac dht id check with ac dht table's id fails when decoding.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>C_DQT_ID_ERR_INT_CLR</name>
              <description>The clear interrupt bit to sign that scan component's dqt id check with dqt table's id fails when decoding.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RST_UXP_ERR_INT_CLR</name>
              <description>The clear interrupt bit to sign that RST header marker is detected but restart interval is 0 when decoding.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RST_CHECK_NONE_ERR_INT_CLR</name>
              <description>The clear interrupt bit to sign that RST header marker is not detected but restart interval is not 0 when decoding.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RST_CHECK_POS_ERR_INT_CLR</name>
              <description>The clear interrupt bit to sign that RST header marker position mismatches with restart interval when decoding.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_EOF_INT_CLR</name>
              <description>The clear interrupt bit turns to high level when the last pixel of one square has been transmitted for Tx channel.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SR_COLOR_MODE_ERR_INT_CLR</name>
              <description>The clear interrupt bit to sign that the selected source color mode is not supported.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DCT_DONE_INT_CLR</name>
              <description>The clear interrupt bit to sign that one dct calculation is finished.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BS_LAST_BLOCK_EOF_INT_CLR</name>
              <description>The clear interrupt bit to sign that the coding process for last block is finished.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SCAN_CHECK_NONE_ERR_INT_CLR</name>
              <description>The clear interrupt bit to sign that SOS header marker is not detected but there are still components left to be decoded.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SCAN_CHECK_POS_ERR_INT_CLR</name>
              <description>The clear interrupt bit to sign that SOS header marker position wrong when decoding.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>UXP_DET_INT_CLR</name>
              <description>The clear interrupt bit to sign that unsupported header marker is detected when decoding.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EN_FRAME_EOF_ERR_INT_CLR</name>
              <description>The clear interrupt bit to sign that received pixel blocks are smaller than expected when encoding.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EN_FRAME_EOF_LACK_INT_CLR</name>
              <description>The clear interrupt bit to sign that the frame eof sign bit from dma input is missing when encoding. But the number of pixel blocks is enough.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DE_FRAME_EOF_ERR_INT_CLR</name>
              <description>The clear interrupt bit to sign that decoded blocks are smaller than expected when decoding.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DE_FRAME_EOF_LACK_INT_CLR</name>
              <description>The clear interrupt bit to sign that the either frame eof from dma input or eoi marker is missing when encoding. But the number of decoded blocks is enough.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SOS_UNMATCH_ERR_INT_CLR</name>
              <description>The clear interrupt bit to sign that the component number of a scan is 0 or does not match the sos marker's length when decoding.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MARKER_ERR_FST_SCAN_INT_CLR</name>
              <description>The clear interrupt bit to sign that the first scan has header marker error when decoding.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MARKER_ERR_OTHER_SCAN_INT_CLR</name>
              <description>The clear interrupt bit to sign that the following scans but not the first scan have header marker error when decoding.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>UNDET_INT_CLR</name>
              <description>The clear interrupt bit to sign that JPEG format is not detected at the eof data of a packet when decoding.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DECODE_TIMEOUT_INT_CLR</name>
              <description>The clear interrupt bit to sign that decode pause time is longer than the setting decode timeout time when decoding.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS0</name>
          <description>Trace and Debug registers</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BITSTREAM_EOF_VLD_CNT</name>
              <description>the valid bit count for last bitstream</description>
              <bitOffset>11</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DCTOUT_ZZSCAN_ADDR</name>
              <description>the zig-zag read addr from dctout_ram</description>
              <bitOffset>17</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>QNRVAL_ZZSCAN_ADDR</name>
              <description>the zig-zag read addr from qnrval_ram</description>
              <bitOffset>23</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_STATE_YUV</name>
              <description>the state of jpeg fsm</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS2</name>
          <description>Trace and Debug registers</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <resetValue>0x08000000</resetValue>
          <fields>
            <field>
              <name>SOURCE_PIXEL</name>
              <description>source pixels fetched from dma</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LAST_BLOCK</name>
              <description>indicate the encoding process for the last mcu of the picture</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LAST_MCU</name>
              <description>indicate the encoding process for the last block of the picture</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LAST_DC</name>
              <description>indicate the encoding process is at the header of the last block of the picture</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PACKFIFO_READY</name>
              <description>the jpeg pack_fifo ready signal, high active</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS3</name>
          <description>Trace and Debug registers</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>YO</name>
              <description>component y transferred from rgb input</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Y_READY</name>
              <description>component y valid signal, high active</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CBO</name>
              <description>component cb transferred from rgb input</description>
              <bitOffset>10</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CB_READY</name>
              <description>component cb valid signal, high active</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRO</name>
              <description>component cr transferred from rgb input</description>
              <bitOffset>20</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CR_READY</name>
              <description>component cr valid signal, high active</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS4</name>
          <description>Trace and Debug registers</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HFM_BITSTREAM</name>
              <description>the hufman bitstream during encoding process</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
