seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
        <register>
          <name>IDBUS_ADDRHOLE_INFO</name>
          <description>need_des</description>
          <addressOffset>0x19C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IDBUS_ADDRHOLE_ID</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDBUS_ADDRHOLE_WR</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDBUS_ADDRHOLE_SECURE</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_POR_RST_BYPASS_CTRL</name>
          <description>need_des</description>
          <addressOffset>0x1A0</addressOffset>
          <size>0x20</size>
          <resetValue>0xFF00FF00</resetValue>
          <fields>
            <field>
              <name>HP_PO_CNNT_RSTN_BYPASS_CTRL</name>
              <description>[15] 1'b1: po_cnnt_rstn bypass sys_sw_rstn
[14] 1'b1: po_cnnt_rstn bypass hp_wdt_sys_rstn
[13] 1'b1: po_cnnt_rstn bypass hp_cpu_intrusion_rstn
[12] 1'b1: po_cnnt_rstn bypass hp_sdio_sys_rstn
[11] 1'b1: po_cnnt_rstn bypass usb_jtag_chip_rst
[10] 1'b1: po_cnnt_rstn bypass usb_uart_chip_rst
[9] 1'b1: po_cnnt_rstn bypass lp_wdt_hp_sys_rstn
[8] 1'b1: po_cnnt_rstn bypass efuse_err_rstn</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_PO_RSTN_BYPASS_CTRL</name>
              <description>[31] 1'b1: po_rstn bypass sys_sw_rstn
[30] 1'b1: po_rstn bypass hp_wdt_sys_rstn
[29] 1'b1: po_rstn bypass hp_cpu_intrusion_rstn
[28] 1'b1: po_rstn bypass hp_sdio_sys_rstn
[27] 1'b1: po_rstn bypass usb_jtag_chip_rst
[26] 1'b1: po_rstn bypass usb_uart_chip_rst
[25] 1'b1: po_rstn bypass lp_wdt_hp_sys_rstn
[24] 1'b1: po_rstn bypass efuse_err_rstn</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_DATA</name>
          <description>rng data register</description>
          <addressOffset>0x1A4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RND_DATA</name>
              <description>result of rng output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_CORE_AHB_TIMEOUT</name>
          <description>need_des</description>
          <addressOffset>0x1B0</addressOffset>
          <size>0x20</size>
          <resetValue>0x007FFFFF</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>set this field to 1 to enable lp core ahb timeout handle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRES</name>
              <description>This field used to set lp core ahb bus timeout  threshold</description>
              <bitOffset>1</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP2HP_AHB_TIMEOUT_EN</name>
              <description>set this field to 1 to enable lp2hp ahb timeout handle</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP2HP_AHB_TIMEOUT_THRES</name>
              <description>This field used to set lp2hp ahb bus timeout  threshold</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_CORE_IBUS_TIMEOUT</name>
          <description>need_des</description>
          <addressOffset>0x1B4</addressOffset>
          <size>0x20</size>
          <resetValue>0x0001FFFF</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>set this field to 1 to enable lp core ibus timeout handle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRES</name>
              <description>This field used to set lp core ibus timeout  threshold</description>
              <bitOffset>1</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_CORE_DBUS_TIMEOUT</name>
          <description>need_des</description>
          <addressOffset>0x1B8</addressOffset>
          <size>0x20</size>
          <resetValue>0x0001FFFF</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>set this field to 1 to enable lp core dbus timeout handle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRES</name>
              <description>This field used to set lp core dbus timeout  threshold</description>
              <bitOffset>1</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_CORE_ERR_RESP_DIS</name>
          <description>need_des</description>
          <addressOffset>0x1BC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LP_CORE_ERR_RESP_DIS</name>
              <description>Set bit0 to disable ibus err resp;Set bit1 to disable dbus err resp; Set bit 2 to disable ahb err resp.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_CFG</name>
          <description>rng cfg register</description>
          <addressOffset>0x1C0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>RNG_TIMER_EN</name>
              <description>enable rng timer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RNG_TIMER_PSCALE</name>
              <description>configure ng timer pscale</description>
              <bitOffset>1</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RNG_SAR_ENABLE</name>
              <description>enable rng_saradc</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RNG_SAR_DATA</name>
              <description>debug rng sar sample cnt</description>
              <bitOffset>16</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
