seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_ANA_PERI</name>
      <description>LP_ANA_PERI Peripheral</description>
      <groupName>LP_ANA_PERI</groupName>
      <baseAddress>0x50113000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x140</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_ANA</name>
        <value>8</value>
      </interrupt>
      <registers>
        <register>
          <name>LP_ANA_BOD_MODE0_CNTL</name>
          <description>need_des</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x0FFC0100</resetValue>
          <fields>
            <field>
              <name>LP_ANA_BOD_MODE0_CLOSE_FLASH_ENA</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_BOD_MODE0_PD_RF_ENA</name>
              <description>need_des</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_BOD_MODE0_INTR_WAIT</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_BOD_MODE0_RESET_WAIT</name>
              <description>need_des</description>
              <bitOffset>18</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_BOD_MODE0_CNT_CLR</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_BOD_MODE0_INTR_ENA</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_BOD_MODE0_RESET_SEL</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_BOD_MODE0_RESET_ENA</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_BOD_MODE1_CNTL</name>
          <description>need_des</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LP_ANA_BOD_MODE1_RESET_ENA</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_VDD_SOURCE_CNTL</name>
          <description>need_des</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x040000FF</resetValue>
          <fields>
            <field>
              <name>LP_ANA_DETMODE_SEL</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_VGOOD_EVENT_RECORD</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_ANA_VBAT_EVENT_RECORD_CLR</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_ANA_BOD_SOURCE_ENA</name>
              <description>need_des</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_VDDBAT_BOD_CNTL</name>
          <description>need_des</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFC00000</resetValue>
          <fields>
            <field>
              <name>LP_ANA_VDDBAT_UNDERVOLTAGE_FLAG</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_ANA_VDDBAT_CHARGER</name>
              <description>need_des</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_VDDBAT_CNT_CLR</name>
              <description>need_des</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_VDDBAT_UPVOLTAGE_TARGET</name>
              <description>need_des</description>
              <bitOffset>12</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_VDDBAT_UNDERVOLTAGE_TARGET</name>
              <description>need_des</description>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_VDDBAT_CHARGE_CNTL</name>
          <description>need_des</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFC00000</resetValue>
          <fields>
            <field>
              <name>LP_ANA_VDDBAT_CHARGE_UNDERVOLTAGE_FLAG</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_ANA_VDDBAT_CHARGE_CHARGER</name>
              <description>need_des</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_VDDBAT_CHARGE_CNT_CLR</name>
              <description>need_des</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_VDDBAT_CHARGE_UPVOLTAGE_TARGET</name>
              <description>need_des</description>
              <bitOffset>12</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_VDDBAT_CHARGE_UNDERVOLTAGE_TARGET</name>
              <description>need_des</description>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_CK_GLITCH_CNTL</name>
          <description>need_des</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LP_ANA_CK_GLITCH_RESET_ENA</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_PG_GLITCH_CNTL</name>
          <description>need_des</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LP_ANA_POWER_GLITCH_RESET_ENA</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_FIB_ENABLE</name>
          <description>need_des</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>LP_ANA_ANA_FIB_ENA</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_INT_RAW</name>
          <description>need_des</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LP_ANA_VDDBAT_CHARGE_UPVOLTAGE_INT_RAW</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_VDDBAT_CHARGE_UNDERVOLTAGE_INT_RAW</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_VDDBAT_UPVOLTAGE_INT_RAW</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_VDDBAT_UNDERVOLTAGE_INT_RAW</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_BOD_MODE0_INT_RAW</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_INT_ST</name>
          <description>need_des</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LP_ANA_VDDBAT_CHARGE_UPVOLTAGE_INT_ST</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_ANA_VDDBAT_CHARGE_UNDERVOLTAGE_INT_ST</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_ANA_VDDBAT_UPVOLTAGE_INT_ST</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_ANA_VDDBAT_UNDERVOLTAGE_INT_ST</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_ANA_BOD_MODE0_INT_ST</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_INT_ENA</name>
          <description>need_des</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LP_ANA_VDDBAT_CHARGE_UPVOLTAGE_INT_ENA</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_VDDBAT_CHARGE_UNDERVOLTAGE_INT_ENA</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_VDDBAT_UPVOLTAGE_INT_ENA</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_VDDBAT_UNDERVOLTAGE_INT_ENA</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_BOD_MODE0_INT_ENA</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_INT_CLR</name>
          <description>need_des</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LP_ANA_VDDBAT_CHARGE_UPVOLTAGE_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_ANA_VDDBAT_CHARGE_UNDERVOLTAGE_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_ANA_VDDBAT_UPVOLTAGE_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_ANA_VDDBAT_UNDERVOLTAGE_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_ANA_BOD_MODE0_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_LP_INT_RAW</name>
          <description>need_des</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LP_ANA_BOD_MODE0_LP_INT_RAW</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_LP_INT_ST</name>
          <description>need_des</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LP_ANA_BOD_MODE0_LP_INT_ST</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_LP_INT_ENA</name>
          <description>need_des</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LP_ANA_BOD_MODE0_LP_INT_ENA</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_LP_INT_CLR</name>
          <description>need_des</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LP_ANA_BOD_MODE0_LP_INT_CLR</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_APPROACH_WORK_MEAS_NUM</name>
          <description>need_des</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <resetValue>0x06419064</resetValue>
          <fields>
            <field>
              <name>LP_ANA_TOUCH_APPROACH_MEAS_NUM2</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_APPROACH_MEAS_NUM1</name>
              <description>need_des</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_APPROACH_MEAS_NUM0</name>
              <description>need_des</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_SCAN_CTRL1</name>
          <description>need_des</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <resetValue>0x00080000</resetValue>
          <fields>
            <field>
              <name>LP_ANA_TOUCH_SHIELD_PAD_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_INACTIVE_CONNECTION</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_SCAN_PAD_MAP</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_XPD_WAIT</name>
              <description>need_des</description>
              <bitOffset>17</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_SCAN_CTRL2</name>
          <description>need_des</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <resetValue>0x37BFFFC0</resetValue>
          <fields>
            <field>
              <name>LP_ANA_TOUCH_TIMEOUT_NUM</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_TIMEOUT_EN</name>
              <description>need_des</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_OUT_RING</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_FREQ_SCAN_EN</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_FREQ_SCAN_CNT_LIMIT</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_TOUCH_WORK</name>
          <description>need_des</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LP_ANA_DIV_NUM2</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_DIV_NUM1</name>
              <description>need_des</description>
              <bitOffset>19</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_DIV_NUM0</name>
              <description>need_des</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_OUT_SEL</name>
              <description>need_des</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_OUT_RESET</name>
              <description>need_des</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_ANA_TOUCH_OUT_GATE</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
