seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
        <register>
          <name>LP_AONCLKRST_XTAL32K</name>
          <description>need_des</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x66C00000</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_DRES_XTAL32K</name>
              <description>need_des</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_DGM_XTAL32K</name>
              <description>need_des</description>
              <bitOffset>25</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_DBUF_XTAL32K</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_DAC_XTAL32K</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_MUX_HPSYS_RESET_BYPASS</name>
          <description>need_des</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_MUX_HPSYS_RESET_BYPASS</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_HPSYS_0_RESET_BYPASS</name>
          <description>need_des</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_HPSYS_0_RESET_BYPASS</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_HPSYS_APM_RESET_BYPASS</name>
          <description>need_des</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_HPSYS_APM_RESET_BYPASS</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_HP_CLK_CTRL</name>
          <description>HP Clock Control Register.</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x1FFFFFFC</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_HP_ROOT_CLK_SRC_SEL</name>
              <description>HP SoC Root Clock Source Select. 2'd0: xtal_40m, 2'd1: cpll_400m, 2'd2: fosc_20m.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_ROOT_CLK_EN</name>
              <description>HP SoC Root Clock Enable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_PAD_PARLIO_TX_CLK_EN</name>
              <description>PARLIO TX Clock From Pad Enable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_PAD_PARLIO_RX_CLK_EN</name>
              <description>PARLIO RX Clock From Pad Enable.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_PAD_UART4_SLP_CLK_EN</name>
              <description>UART4 SLP Clock From Pad Enable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_PAD_UART3_SLP_CLK_EN</name>
              <description>UART3 SLP Clock From Pad Enable.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_PAD_UART2_SLP_CLK_EN</name>
              <description>UART2 SLP Clock From Pad Enable.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_PAD_UART1_SLP_CLK_EN</name>
              <description>UART1 SLP Clock From Pad Enable.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_PAD_UART0_SLP_CLK_EN</name>
              <description>UART0 SLP Clock From Pad Enable.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_PAD_I2S2_MCLK_EN</name>
              <description>I2S2 MCLK Clock From Pad Enable.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_PAD_I2S1_MCLK_EN</name>
              <description>I2S1 MCLK Clock From Pad Enable.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_PAD_I2S0_MCLK_EN</name>
              <description>I2S0 MCLK Clock From Pad Enable.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_PAD_EMAC_TX_CLK_EN</name>
              <description>EMAC RX Clock From Pad Enable.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_PAD_EMAC_RX_CLK_EN</name>
              <description>EMAC TX Clock From Pad Enable.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_PAD_EMAC_TXRX_CLK_EN</name>
              <description>EMAC TXRX Clock From Pad Enable.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_XTAL_32K_CLK_EN</name>
              <description>XTAL 32K Clock Enable.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_RC_32K_CLK_EN</name>
              <description>RC 32K Clock Enable.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_SOSC_150K_CLK_EN</name>
              <description>SOSC 150K Clock Enable.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_PLL_8M_CLK_EN</name>
              <description>PLL 8M Clock Enable.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_AUDIO_PLL_CLK_EN</name>
              <description>AUDIO PLL Clock Enable.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_SDIO_PLL2_CLK_EN</name>
              <description>SDIO PLL2 Clock Enable.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_SDIO_PLL1_CLK_EN</name>
              <description>SDIO PLL1 Clock Enable.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_SDIO_PLL0_CLK_EN</name>
              <description>SDIO PLL0 Clock Enable.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_FOSC_20M_CLK_EN</name>
              <description>FOSC 20M Clock Enable.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_XTAL_40M_CLK_EN</name>
              <description>XTAL 40M Clock Enalbe.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_CPLL_400M_CLK_EN</name>
              <description>CPLL 400M Clock Enable.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_SPLL_480M_CLK_EN</name>
              <description>SPLL 480M Clock Enable.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HP_MPLL_500M_CLK_EN</name>
              <description>MPLL 500M Clock Enable.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_HP_USB_CLKRST_CTRL0</name>
          <description>HP USB Clock Reset Control Register.</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x09C4C27A</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_USB_OTG20_SLEEP_MODE</name>
              <description>unused.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_USB_OTG20_BK_SYS_CLK_EN</name>
              <description>unused.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_USB_OTG11_SLEEP_MODE</name>
              <description>unused.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_USB_OTG11_BK_SYS_CLK_EN</name>
              <description>unused.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_USB_OTG11_48M_CLK_EN</name>
              <description>usb otg11 fs phy clock enable.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_USB_DEVICE_48M_CLK_EN</name>
              <description>usb device fs phy clock enable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_USB_48M_DIV_NUM</name>
              <description>usb 480m to 25m divide number.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_USB_25M_DIV_NUM</name>
              <description>usb 500m to 25m divide number.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_USB_12M_DIV_NUM</name>
              <description>usb 480m to 12m divide number.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_HP_USB_CLKRST_CTRL1</name>
          <description>HP USB Clock Reset Control Register.</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0xC0000000</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_RST_EN_USB_OTG20_ADP</name>
              <description>usb otg20 adp reset en</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_RST_EN_USB_OTG20_PHY</name>
              <description>usb otg20 phy reset en</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_RST_EN_USB_OTG20</name>
              <description>usb otg20 reset en</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_RST_EN_USB_OTG11</name>
              <description>usb org11 reset en</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_RST_EN_USB_DEVICE</name>
              <description>usb device reset en</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_USB_OTG20_PHYREF_CLK_SRC_SEL</name>
              <description>usb otg20 hs phy src sel. 2'd0: 12m, 2'd1: 25m, 2'd2: pad_hsphy_refclk.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_USB_OTG20_PHYREF_CLK_EN</name>
              <description>usb otg20 hs phy refclk enable.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_USB_OTG20_ULPI_CLK_EN</name>
              <description>usb otg20 ulpi clock enable.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_HP_SDMMC_EMAC_RST_CTRL</name>
          <description>need_des</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LP_AONCLKRST_RST_EN_SDMMC</name>
              <description>hp sdmmc reset en</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_FORCE_NORST_SDMMC</name>
              <description>hp sdmmc force norst</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_RST_EN_EMAC</name>
              <description>hp emac reset en</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_FORCE_NORST_EMAC</name>
              <description>hp emac force norst</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_DATE</name>
          <description>need_des</description>
          <addressOffset>0x3FC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LP_AONCLKRST_CLK_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
