seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
        <register>
          <name>BLEND_RGB</name>
          <description>RGB color register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0x00808080</resetValue>
          <fields>
            <field>
              <name>BLEND1_RX_B</name>
              <description>blue color for A4/A8 mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEND1_RX_G</name>
              <description>green color for A4/A8 mode.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEND1_RX_R</name>
              <description>red color for A4/A8 mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLEND_FIX_PIXEL</name>
          <description>Blending engine fix pixel register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLEND_TX_FIX_PIXEL</name>
              <description>The configure fix pixel in fix pixel filling mode for blender engine.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CK_FG_LOW</name>
          <description>foreground color key lower threshold</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00FFFFFF</resetValue>
          <fields>
            <field>
              <name>COLORKEY_FG_B_LOW</name>
              <description>color key lower threshold of foreground b channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLORKEY_FG_G_LOW</name>
              <description>color key lower threshold of foreground g channel</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLORKEY_FG_R_LOW</name>
              <description>color key lower threshold of foreground r channel</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CK_FG_HIGH</name>
          <description>foreground color key higher threshold</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COLORKEY_FG_B_HIGH</name>
              <description>color key higher threshold of foreground b channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLORKEY_FG_G_HIGH</name>
              <description>color key higher threshold of foreground g channel</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLORKEY_FG_R_HIGH</name>
              <description>color key higher threshold of foreground r channel</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CK_BG_LOW</name>
          <description>background color key lower threshold</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <resetValue>0x00FFFFFF</resetValue>
          <fields>
            <field>
              <name>COLORKEY_BG_B_LOW</name>
              <description>color key lower threshold of background b channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLORKEY_BG_G_LOW</name>
              <description>color key lower threshold of background g channel</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLORKEY_BG_R_LOW</name>
              <description>color key lower threshold of background r channel</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CK_BG_HIGH</name>
          <description>background color key higher threshold</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COLORKEY_BG_B_HIGH</name>
              <description>color key higher threshold of background b channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLORKEY_BG_G_HIGH</name>
              <description>color key higher threshold of background g channel</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLORKEY_BG_R_HIGH</name>
              <description>color key higher threshold of background r channel</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CK_DEFAULT</name>
          <description>default value when foreground and background both in color key range</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COLORKEY_DEFAULT_B</name>
              <description>default B channle value of color key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLORKEY_DEFAULT_G</name>
              <description>default G channle value of color key</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLORKEY_DEFAULT_R</name>
              <description>default R channle value of color key</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLORKEY_FG_BG_REVERSE</name>
              <description>when pixel in bg ck range but not in fg ck range, 0: the result is bg, 1: the result is fg</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR_SCAL_ROTATE</name>
          <description>Scaling and rotating coefficient register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x00001001</resetValue>
          <fields>
            <field>
              <name>SR_SCAL_X_INT</name>
              <description>The integrated part of scaling coefficient in X direction.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SR_SCAL_X_FRAG</name>
              <description>The fragment part of scaling coefficient in X direction.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SR_SCAL_Y_INT</name>
              <description>The integrated part of scaling coefficient in Y direction.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SR_SCAL_Y_FRAG</name>
              <description>The fragment part of scaling coefficient in Y direction.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SR_ROTATE_ANGLE</name>
              <description>The rotate angle. 0: 0 degree. 1: 90 degree. 2: 180 degree. 3: 270 degree.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAL_ROTATE_RST</name>
              <description>Write 1 then write 0 to this bit to reset scaling and rotating engine.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAL_ROTATE_START</name>
              <description>Write 1 to enable scaling and rotating engine after parameter is configured.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SR_MIRROR_X</name>
              <description>Image mirror in X direction. 0: disable, 1: enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SR_MIRROR_Y</name>
              <description>Image mirror in Y direction. 0: disable, 1: enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR_MEM_PD</name>
          <description>SR memory power done register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SR_MEM_CLK_ENA</name>
              <description>Set this bit to force clock enable of scaling and rotating engine's data memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SR_MEM_FORCE_PD</name>
              <description>Set this bit to force power down scaling and rotating engine's data memory.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SR_MEM_FORCE_PU</name>
              <description>Set this bit to force power up scaling and rotating engine's data memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CONF</name>
          <description>Register clock enable register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>PPA register clock gate enable signal.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLUT_CNT</name>
          <description>BLEND CLUT write counter register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLEND0_CLUT_CNT</name>
              <description>The write data counter of BLEND0 CLUT in fifo mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BLEND1_CLUT_CNT</name>
              <description>The write data counter of BLEND1 CLUT in fifo mode.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLEND_ST</name>
          <description>Blending engine status register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLEND_SIZE_DIFF_ST</name>
              <description>1: indicate the size of two image is different.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR_PARAM_ERR_ST</name>
          <description>Scaling and rotating coefficient error register</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_DSCR_VB_ERR_ST</name>
              <description>The error is that the scaled VB plus the offset of Y coordinate in 2DDMA receive descriptor is larger than VA in 2DDMA receive descriptor.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_DSCR_HB_ERR_ST</name>
              <description>The error is that the scaled HB plus the offset of X coordinate in 2DDMA receive descriptor is larger than HA in 2DDMA receive descriptor.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Y_RX_SCAL_EQUAL_0_ERR_ST</name>
              <description>The error is that the PPA_SR_SCAL_Y_INT and PPA_SR_CAL_Y_FRAG both are 0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_DSCR_VB_ERR_ST</name>
              <description>The error is that VB in 2DDMA receive descriptor plus the offset of Y coordinate in 2DDMA transmit descriptor is larger than VA in 2DDMA transmit descriptor</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>YDST_LEN_TOO_SAMLL_ERR_ST</name>
              <description>The error is that the scaled image width is 0. For example.  when source width is 14. scaled value is 1/16. and no rotate operation. then scaled width would be 0 as the result would be floored.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>YDST_LEN_TOO_LARGE_ERR_ST</name>
              <description>The error is that the scaled width is larger than (2^13 - 1).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>X_RX_SCAL_EQUAL_0_ERR_ST</name>
              <description>The error is that the scaled image height is 0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_DSCR_HB_ERR_ST</name>
              <description>The error is that the HB in 2DDMA transmit descriptor plus the offset of X coordinate in 2DDMA transmit descriptor is larger than HA in 2DDMA transmit descriptor.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>XDST_LEN_TOO_SAMLL_ERR_ST</name>
              <description>The error is that the scaled image height is 0. For example.  when source height is 14. scaled value is 1/16. and no rotate operation. then scaled height would be 0 as the result would be floored.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>XDST_LEN_TOO_LARGE_ERR_ST</name>
              <description>The error is that the scaled image height is larger than (2^13 - 1).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>X_YUV420_RX_SCALE_ERR_ST</name>
              <description>The error is that the ha/hb/x param in dma2d descriptor is an odd num when enable yuv420 rx</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Y_YUV420_RX_SCALE_ERR_ST</name>
              <description>The error is that the va/vb/y param in dma2d descriptor is an odd num when enable yuv420 rx</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>X_YUV420_TX_SCALE_ERR_ST</name>
              <description>The error is that the ha/hb/x param in dma2d descriptor is an odd num when enable yuv420 tx</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Y_YUV420_TX_SCALE_ERR_ST</name>
              <description>The error is that the va/vb/y param in dma2d descriptor is an odd num when enable yuv420 tx</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR_STATUS</name>
          <description>SR FSM register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SR_RX_DSCR_SAMPLE_STATE</name>
              <description>Reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SR_RX_SCAN_STATE</name>
              <description>Reserved.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SR_TX_DSCR_SAMPLE_STATE</name>
              <description>Reserved.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SR_TX_SCAN_STATE</name>
              <description>Reserved.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECO_LOW</name>
          <description>Reserved.</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RND_ECO_LOW</name>
              <description>Reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECO_HIGH</name>
          <description>Reserved.</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>RND_ECO_HIGH</name>
              <description>Reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECO_CELL_CTRL</name>
          <description>Reserved.</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RDN_RESULT</name>
              <description>Reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDN_ENA</name>
              <description>Reserved.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM_CTRL</name>
          <description>PPA SRAM Control Register</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00001320</resetValue>
          <fields>
            <field>
              <name>MEM_AUX_CTRL</name>
              <description>Control signals</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>PPA Version register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <resetValue>0x02304041</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>register version.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
