seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
        <register>
          <name>INT_RAW</name>
          <description>Raw interrupt status</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH0_TX_END_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL0. Triggered when transmission done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_TX_END_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL1. Triggered when transmission done.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_TX_END_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL2. Triggered when transmission done.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_TX_END_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL3. Triggered when transmission done.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_CH0_ERR_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL0. Triggered when error occurs.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_CH1_ERR_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL1. Triggered when error occurs.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_CH2_ERR_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL2. Triggered when error occurs.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_CH3_ERR_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL3. Triggered when error occurs.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_TX_THR_EVENT_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL0. Triggered when transmitter sent more data than configured value.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_TX_THR_EVENT_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL1. Triggered when transmitter sent more data than configured value.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_TX_THR_EVENT_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL2. Triggered when transmitter sent more data than configured value.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_TX_THR_EVENT_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL3. Triggered when transmitter sent more data than configured value.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_TX_LOOP_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL0. Triggered when the loop count reaches the configured threshold value.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_TX_LOOP_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL1. Triggered when the loop count reaches the configured threshold value.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_TX_LOOP_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL2. Triggered when the loop count reaches the configured threshold value.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_TX_LOOP_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL3. Triggered when the loop count reaches the configured threshold value.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_RX_END_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL4. Triggered when reception done.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5_RX_END_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL5. Triggered when reception done.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6_RX_END_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL6. Triggered when reception done.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH7_RX_END_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL7. Triggered when reception done.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CH4_ERR_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL4. Triggered when error occurs.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CH5_ERR_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL5. Triggered when error occurs.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CH6_ERR_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL6. Triggered when error occurs.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CH7_ERR_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL7. Triggered when error occurs.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_RX_THR_EVENT_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL4. Triggered when receiver receive more data than configured value.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5_RX_THR_EVENT_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL5. Triggered when receiver receive more data than configured value.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6_RX_THR_EVENT_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL6. Triggered when receiver receive more data than configured value.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH7_RX_THR_EVENT_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL7. Triggered when receiver receive more data than configured value.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_CH3_DMA_ACCESS_FAIL_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL3. Triggered when dma accessing CHANNEL3 fails.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CH7_DMA_ACCESS_FAIL_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL7. Triggered when dma accessing CHANNEL7 fails.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>Masked interrupt status</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH0_TX_END_INT_ST</name>
              <description>The masked interrupt status bit for CH0_TX_END_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1_TX_END_INT_ST</name>
              <description>The masked interrupt status bit for CH1_TX_END_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2_TX_END_INT_ST</name>
              <description>The masked interrupt status bit for CH2_TX_END_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_TX_END_INT_ST</name>
              <description>The masked interrupt status bit for CH3_TX_END_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_CH0_ERR_INT_ST</name>
              <description>The masked interrupt status bit for CH0_ERR_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_CH1_ERR_INT_ST</name>
              <description>The masked interrupt status bit for CH1_ERR_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_CH2_ERR_INT_ST</name>
              <description>The masked interrupt status bit for CH2_ERR_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_CH3_ERR_INT_ST</name>
              <description>The masked interrupt status bit for CH3_ERR_INT.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0_TX_THR_EVENT_INT_ST</name>
              <description>The masked interrupt status bit for CH0_TX_THR_EVENT_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1_TX_THR_EVENT_INT_ST</name>
              <description>The masked interrupt status bit for CH1_TX_THR_EVENT_INT.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2_TX_THR_EVENT_INT_ST</name>
              <description>The masked interrupt status bit for CH2_TX_THR_EVENT_INT.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_TX_THR_EVENT_INT_ST</name>
              <description>The masked interrupt status bit for CH3_TX_THR_EVENT_INT.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0_TX_LOOP_INT_ST</name>
              <description>The masked interrupt status bit for CH0_TX_LOOP_INT.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1_TX_LOOP_INT_ST</name>
              <description>The masked interrupt status bit for CH1_TX_LOOP_INT.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2_TX_LOOP_INT_ST</name>
              <description>The masked interrupt status bit for CH2_TX_LOOP_INT.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3_TX_LOOP_INT_ST</name>
              <description>The masked interrupt status bit for CH3_TX_LOOP_INT.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH4_RX_END_INT_ST</name>
              <description>The masked interrupt status bit for CH4_RX_END_INT.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH5_RX_END_INT_ST</name>
              <description>The masked interrupt status bit for CH5_RX_END_INT.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH6_RX_END_INT_ST</name>
              <description>The masked interrupt status bit for CH6_RX_END_INT.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH7_RX_END_INT_ST</name>
              <description>The masked interrupt status bit for CH7_RX_END_INT.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_CH4_ERR_INT_ST</name>
              <description>The masked interrupt status bit for CH4_ERR_INT.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_CH5_ERR_INT_ST</name>
              <description>The masked interrupt status bit for CH5_ERR_INT.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_CH6_ERR_INT_ST</name>
              <description>The masked interrupt status bit for CH6_ERR_INT.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_CH7_ERR_INT_ST</name>
              <description>The masked interrupt status bit for CH7_ERR_INT.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH4_RX_THR_EVENT_INT_ST</name>
              <description>The masked interrupt status bit for CH4_RX_THR_EVENT_INT.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH5_RX_THR_EVENT_INT_ST</name>
              <description>The masked interrupt status bit for CH5_RX_THR_EVENT_INT.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH6_RX_THR_EVENT_INT_ST</name>
              <description>The masked interrupt status bit for CH6_RX_THR_EVENT_INT.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH7_RX_THR_EVENT_INT_ST</name>
              <description>The masked interrupt status bit for CH7_RX_THR_EVENT_INT.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_CH3_DMA_ACCESS_FAIL_INT_ST</name>
              <description>The masked interrupt status bit for  CH3_DMA_ACCESS_FAIL_INT.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_CH7_DMA_ACCESS_FAIL_INT_ST</name>
              <description>The masked interrupt status bit for  CH7_DMA_ACCESS_FAIL_INT.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
