seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RSA</name>
      <description>RSA (Rivest Shamir Adleman) Accelerator</description>
      <groupName>RSA</groupName>
      <baseAddress>0x50092000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x74</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RSA</name>
        <value>68</value>
      </interrupt>
      <registers>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>M_MEM[%s]</name>
          <description>Represents M</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>Z_MEM[%s]</name>
          <description>Represents Z</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>Y_MEM[%s]</name>
          <description>Represents Y</description>
          <addressOffset>0x400</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>X_MEM[%s]</name>
          <description>Represents X</description>
          <addressOffset>0x600</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>M_PRIME</name>
          <description>Represents M’</description>
          <addressOffset>0x800</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>M_PRIME</name>
              <description>Represents M’</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>Configures RSA length</description>
          <addressOffset>0x804</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>Configures the RSA length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QUERY_CLEAN</name>
          <description>RSA clean register</description>
          <addressOffset>0x808</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>QUERY_CLEAN</name>
              <description>Represents whether or not the RSA memory completes initialization.

0: Not complete

1: Completed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_START_MODEXP</name>
          <description>Starts modular exponentiation</description>
          <addressOffset>0x80C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SET_START_MODEXP</name>
              <description>Configure whether or not to start the modular exponentiation.

0: No effect

1: Start</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_START_MODMULT</name>
          <description>Starts modular multiplication</description>
          <addressOffset>0x810</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SET_START_MODMULT</name>
              <description>Configure whether or not to start the modular multiplication.

0: No effect

1: Start</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_START_MULT</name>
          <description>Starts multiplication</description>
          <addressOffset>0x814</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SET_START_MULT</name>
              <description>Configure whether or not to start the multiplication.

0: No effect

1: Start</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QUERY_IDLE</name>
          <description>Represents the RSA status</description>
          <addressOffset>0x818</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>QUERY_IDLE</name>
              <description>Represents the RSA status.

0: Busy

1: Idle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>Clears RSA interrupt</description>
          <addressOffset>0x81C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLEAR_INTERRUPT</name>
              <description>Write 1 to clear the RSA interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSTANT_TIME</name>
          <description>Configures the constant_time option</description>
          <addressOffset>0x820</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CONSTANT_TIME</name>
              <description>Configures the constant_time option. 

