seyednasermoravej/EscapeRoom/esp_svd/esp32p4.svd
        <register>
          <name>CH40_TASK_ID</name>
          <description>Channel40 task id register</description>
          <addressOffset>0x15C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH40_TASK_ID</name>
              <description>Configures ch40_task_id</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH41_EVT_ID</name>
          <description>Channel41 event id register</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH41_EVT_ID</name>
              <description>Configures ch41_evt_id</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH41_TASK_ID</name>
          <description>Channel41 task id register</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH41_TASK_ID</name>
              <description>Configures ch41_task_id</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH42_EVT_ID</name>
          <description>Channel42 event id register</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH42_EVT_ID</name>
              <description>Configures ch42_evt_id</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH42_TASK_ID</name>
          <description>Channel42 task id register</description>
          <addressOffset>0x16C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH42_TASK_ID</name>
              <description>Configures ch42_task_id</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH43_EVT_ID</name>
          <description>Channel43 event id register</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH43_EVT_ID</name>
              <description>Configures ch43_evt_id</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH43_TASK_ID</name>
          <description>Channel43 task id register</description>
          <addressOffset>0x174</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH43_TASK_ID</name>
              <description>Configures ch43_task_id</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH44_EVT_ID</name>
          <description>Channel44 event id register</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH44_EVT_ID</name>
              <description>Configures ch44_evt_id</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH44_TASK_ID</name>
          <description>Channel44 task id register</description>
          <addressOffset>0x17C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH44_TASK_ID</name>
              <description>Configures ch44_task_id</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH45_EVT_ID</name>
          <description>Channel45 event id register</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH45_EVT_ID</name>
              <description>Configures ch45_evt_id</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH45_TASK_ID</name>
          <description>Channel45 task id register</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH45_TASK_ID</name>
              <description>Configures ch45_task_id</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH46_EVT_ID</name>
          <description>Channel46 event id register</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH46_EVT_ID</name>
              <description>Configures ch46_evt_id</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH46_TASK_ID</name>
          <description>Channel46 task id register</description>
          <addressOffset>0x18C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH46_TASK_ID</name>
              <description>Configures ch46_task_id</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH47_EVT_ID</name>
          <description>Channel47 event id register</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH47_EVT_ID</name>
              <description>Configures ch47_evt_id</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH47_TASK_ID</name>
          <description>Channel47 task id register</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH47_TASK_ID</name>
              <description>Configures ch47_task_id</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH48_EVT_ID</name>
          <description>Channel48 event id register</description>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH48_EVT_ID</name>
              <description>Configures ch48_evt_id</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH48_TASK_ID</name>
          <description>Channel48 task id register</description>
          <addressOffset>0x19C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH48_TASK_ID</name>
              <description>Configures ch48_task_id</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH49_EVT_ID</name>
          <description>Channel49 event id register</description>
          <addressOffset>0x1A0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH49_EVT_ID</name>
              <description>Configures ch49_evt_id</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH49_TASK_ID</name>
          <description>Channel49 task id register</description>
          <addressOffset>0x1A4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH49_TASK_ID</name>
              <description>Configures ch49_task_id</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVT_ST0</name>
          <description>Events trigger status register</description>
          <addressOffset>0x1A8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>GPIO_EVT_CH0_RISE_EDGE_ST</name>
              <description>Represents GPIO_evt_ch0_rise_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH1_RISE_EDGE_ST</name>
              <description>Represents GPIO_evt_ch1_rise_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH2_RISE_EDGE_ST</name>
              <description>Represents GPIO_evt_ch2_rise_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH3_RISE_EDGE_ST</name>
              <description>Represents GPIO_evt_ch3_rise_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH4_RISE_EDGE_ST</name>
              <description>Represents GPIO_evt_ch4_rise_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH5_RISE_EDGE_ST</name>
              <description>Represents GPIO_evt_ch5_rise_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH6_RISE_EDGE_ST</name>
              <description>Represents GPIO_evt_ch6_rise_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH7_RISE_EDGE_ST</name>
              <description>Represents GPIO_evt_ch7_rise_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH0_FALL_EDGE_ST</name>
              <description>Represents GPIO_evt_ch0_fall_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH1_FALL_EDGE_ST</name>
              <description>Represents GPIO_evt_ch1_fall_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH2_FALL_EDGE_ST</name>
              <description>Represents GPIO_evt_ch2_fall_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH3_FALL_EDGE_ST</name>
              <description>Represents GPIO_evt_ch3_fall_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH4_FALL_EDGE_ST</name>
              <description>Represents GPIO_evt_ch4_fall_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH5_FALL_EDGE_ST</name>
              <description>Represents GPIO_evt_ch5_fall_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH6_FALL_EDGE_ST</name>
              <description>Represents GPIO_evt_ch6_fall_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH7_FALL_EDGE_ST</name>
              <description>Represents GPIO_evt_ch7_fall_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH0_ANY_EDGE_ST</name>
              <description>Represents GPIO_evt_ch0_any_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH1_ANY_EDGE_ST</name>
              <description>Represents GPIO_evt_ch1_any_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH2_ANY_EDGE_ST</name>
              <description>Represents GPIO_evt_ch2_any_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH3_ANY_EDGE_ST</name>
              <description>Represents GPIO_evt_ch3_any_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH4_ANY_EDGE_ST</name>
              <description>Represents GPIO_evt_ch4_any_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH5_ANY_EDGE_ST</name>
              <description>Represents GPIO_evt_ch5_any_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH6_ANY_EDGE_ST</name>
              <description>Represents GPIO_evt_ch6_any_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_CH7_ANY_EDGE_ST</name>
              <description>Represents GPIO_evt_ch7_any_edge trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_ZERO_DET_POS0_ST</name>
              <description>Represents GPIO_evt_zero_det_pos0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_ZERO_DET_NEG0_ST</name>
              <description>Represents GPIO_evt_zero_det_neg0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_ZERO_DET_POS1_ST</name>
              <description>Represents GPIO_evt_zero_det_pos1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EVT_ZERO_DET_NEG1_ST</name>
              <description>Represents GPIO_evt_zero_det_neg1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_EVT_DUTY_CHNG_END_CH0_ST</name>
              <description>Represents LEDC_evt_duty_chng_end_ch0 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_EVT_DUTY_CHNG_END_CH1_ST</name>
              <description>Represents LEDC_evt_duty_chng_end_ch1 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_EVT_DUTY_CHNG_END_CH2_ST</name>
              <description>Represents LEDC_evt_duty_chng_end_ch2 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_EVT_DUTY_CHNG_END_CH3_ST</name>
              <description>Represents LEDC_evt_duty_chng_end_ch3 trigger status.\\0: Not triggered\\1: Triggered</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
